<?php
function is_cli()
{
	return preg_match("/cli/i", php_sapi_name()) ? true : false;
}

if (is_cli()) {
	$date_id = date('Y-m-d H:i:s');
	echo $date_id . "\n";
	echo '亲爱的管理员，程序正在按照您的吩咐执行！' . "\n";
} else {
	exit('对不起，您不能运行该文件!');
}

/* PHP运行时间&内存消耗统计工具
 * 精确度：
 * 	不足24小时：0.01秒(10毫秒)～24小时
 * 	超过24小时：1秒～数天
 */
// 开始的时钟时间（秒）
$huafei_time_start = microtime(true);
function changeTimeType()
{
	// 结束的时钟时间（秒）
	$huafei_time_end = microtime(true);
	// 计算脚本执行时间
	$seconds = ($huafei_time_end - $GLOBALS['huafei_time_start']);
	if ($seconds > 3600) {
		$hours = intval($seconds / 3600);
		$minutes = $seconds % 3600;
		$time = $hours . "小时" . gmstrftime('%M分钟%S秒', $minutes);
	} else {
		$jingduS = mb_substr($seconds, stripos($seconds, '.'), 3);
		$time = gmstrftime('%H小时%M分钟%S' . $jingduS . '秒', $seconds);
		if (mb_substr($time, 0, 2) == '00') {
			$time = gmstrftime('%M分钟%S' . $jingduS . '秒', $seconds);
		}
		if (mb_substr($time, 0, 2) == '00') {
			//诡异的if语句，因为$time在上一个if语句被修改了所以此处不是mb_substr($time,4,2)，而是mb_substr($time,0,2)
			$time = gmstrftime('%S' . $jingduS . '秒', $seconds);
		}
		if (mb_substr($time, 0, 2) == '00') {
			$time = gmstrftime('0' . $jingduS . '秒', $seconds);
			if ($jingduS == '0') {
				$time = '0秒';
			}
		}
	}
	//分配给PHP的总内存
	$neicun_zong = memory_get_usage(true);
	$neicun_zong_kb = $neicun_zong / 1024;
	$neicun_zong_out = $neicun_zong_kb . ' ' . 'KB';
	if ($neicun_zong_kb > 10240) {
		$neicun_zong_mb = $neicun_zong_kb / 1024;
		$neicun_zong_out = $neicun_zong_mb . ' ' . 'MB';
	}
	if ($neicun_zong_mb > 10240) {
		$neicun_zong_gb = $neicun_zong_mb / 1024;
		$neicun_zong_out = $neicun_zong_gb . ' ' . 'GB';
	}
	//PHP实际使用的内存
	$neicun_yong = memory_get_usage(false);
	$neicun_yong_kb = $neicun_yong / 1024;
	$neicun_yong_out = $neicun_yong_kb . ' ' . 'KB';
	if ($neicun_yong_kb > 10240) {
		$neicun_yong_mb = $neicun_yong_kb / 1024;
		$neicun_yong_out = $neicun_yong_mb . ' ' . 'MB';
	}
	if ($neicun_yong_mb > 10240) {
		$neicun_yong_gb = $neicun_yong_mb / 1024;
		$neicun_yong_out = $neicun_yong_gb . ' ' . 'GB';
	}
	echo $GLOBALS['date_id'] . '，' . date('Y-m-d H:i:s') . "\n";
	echo 'PHP：总内存「' . $neicun_zong_out . '」' . ' ' . '消耗内存「' . $neicun_yong_out . '」' . ' ' . '耗时「' . $time . '」' . "\n";
}
register_shutdown_function("changeTimeType");
/*PHP运行时间&内存消耗统计结束*/

/**
 * 发送post请求
 * @param string $url 请求地址
 * @param array $post_data post键值对数据
 * @return string
 */
function send_post($url, $post_data, $id)
{
	$postdata = http_build_query($post_data);
	$options = array(
		'http' => array(
			'method' => 'POST',
			'header' => array(
				'Content-Type: application/x-www-form-urlencoded',
				'Host: music.163.com',
				'Origin: https://music.163.com',
				'User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1.3 Safari/605.1.15',
				'Referer: https://music.163.com/song?id=' . $id,
			),
			'content' => $postdata,
			'timeout' => 15 * 60 // 超时时间（单位:s）
		)
	);
	$context = stream_context_create($options);
	$result = file_get_contents($url, false, $context);
	if ($result == false) {
		$result = file_get_contents($url, false, $context);
		if ($result == false) {
			$result = file_get_contents($url, false, $context);
			if ($result == false) {
				$result = file_get_contents($url, false, $context);
				if ($result == false) {
					$result = file_get_contents($url, false, $context);
				}
			}
		}
	}
	return $result;
}
//请求结束

/**
 * 发送post请求
 * @param string $url 请求地址
 * @param array $post_data post键值对数据
 * @return string
 */
function send_post2($url, $postdata)
{
	$options = array(
		'http' => array(
			'method' => 'POST',
			'header' => array(
				'Content-Type: application/json',
				'Origin: http://ltp.ai',
				'Host: 39.96.43.154:8080',
				'User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1.3 Safari/605.1.15',
				'Referer: http://ltp.ai/',
			),
			'content' => $postdata,
			'timeout' => 15 * 60 // 超时时间（单位:s）
		)
	);
	$context = stream_context_create($options);
	$result = file_get_contents($url, false, $context);
	if ($result == false) {
		$result = file_get_contents($url, false, $context);
		if ($result == false) {
			$result = file_get_contents($url, false, $context);
			if ($result == false) {
				$result = file_get_contents($url, false, $context);
				if ($result == false) {
					$result = file_get_contents($url, false, $context);
				}
			}
		}
	}
	return $result;
}
//请求结束

/**
 * 发送post请求
 * @param string $url 请求地址
 * @param array $post_data post键值对数据
 * @return string
 */
function send_post3($url, $post_data, $id)
{
	$postdata = http_build_query($post_data);
	$options = array(
		'http' => array(
			'method' => 'POST',
			'header' => array(
				'Content-Type: application/x-www-form-urlencoded',
				'Host: music.163.com',
				'Origin: https://music.163.com',
				'User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1.3 Safari/605.1.15',
				'Referer: https://music.163.com/song?id=' . $id,
			),
			'content' => $postdata,
			'timeout' => 15 * 60 // 超时时间（单位:s）
		)
	);
	$context = stream_context_create($options);
	$result = file_get_contents($url, false, $context);
	if ($result == false) {
		$result = file_get_contents($url, false, $context);
		if ($result == false) {
			$result = file_get_contents($url, false, $context);
			if ($result == false) {
				$result = file_get_contents($url, false, $context);
				if ($result == false) {
					$result = file_get_contents($url, false, $context);
				}
			}
		}
	}
	return $result;
}
//请求结束

class Time
{
	/**
	 * 获取毫秒级别的时间戳
	 */
	public function getMsecTime()
	{
		list($msec, $sec) = explode(' ', microtime());
		$msectime =  (float)sprintf('%.0f', (floatval($msec) + floatval($sec)) * 1000);
		return $msectime;
	}

	/**
	 * 毫秒时间戳转日期
	 */
	function getMsecToMescdate($time, $TimeType)
	{
		$time = $time + 28800000;
		$time = $time * 0.001;
		if (strstr($time, '.')) {
			sprintf("%01.3f", $time); //小数点。不足三位补0
			list($usec, $sec) = explode(".", $time);
			$sec = str_pad($sec, 3, "0", STR_PAD_RIGHT); //不足3位。右边补0
		} else {
			$usec = $time;
			$sec = "000";
		}
		if ($TimeType == 'UserContentTime') {
			$date = date("Y-m-d H:i:s", $usec);
			return $date;
		} else if ($TimeType == 'UserBirthday') {
			$date = date("Y-m-d", $usec);
			return $date;
		}
	}

	//时间戳转年龄
	public function Millisecond_timestamp_to_Age($Time)
	{
		if ($Time > 31536000000) {
			$year = floor($Time / 31536000000);
		} else {
			$year = null;
		}
		return $year;
	}
}

class XingZhengCode
{
	public function xingzhengcode($in)
	{
		$Data = 'a:3209:{i:110000;s:9:"北京市";i:110101;s:9:"东城区";i:110102;s:9:"西城区";i:110105;s:9:"朝阳区";i:110106;s:9:"丰台区";i:110107;s:12:"石景山区";i:110108;s:9:"海淀区";i:110109;s:12:"门头沟区";i:110111;s:9:"房山区";i:110112;s:9:"通州区";i:110113;s:9:"顺义区";i:110114;s:9:"昌平区";i:110115;s:9:"大兴区";i:110116;s:9:"怀柔区";i:110117;s:9:"平谷区";i:110118;s:9:"密云区";i:110119;s:9:"延庆区";i:120000;s:9:"天津市";i:120101;s:9:"和平区";i:120102;s:9:"河东区";i:120103;s:9:"河西区";i:120104;s:9:"南开区";i:120105;s:9:"河北区";i:120106;s:9:"红桥区";i:120110;s:9:"东丽区";i:120111;s:9:"西青区";i:120112;s:9:"津南区";i:120113;s:9:"北辰区";i:120114;s:9:"武清区";i:120115;s:9:"宝坻区";i:120116;s:12:"滨海新区";i:120117;s:9:"宁河区";i:120118;s:9:"静海区";i:120119;s:9:"蓟州区";i:130000;s:9:"河北省";i:130100;s:12:"石家庄市";i:130102;s:9:"长安区";i:130104;s:9:"桥西区";i:130105;s:9:"新华区";i:130107;s:12:"井陉矿区";i:130108;s:9:"裕华区";i:130109;s:9:"藁城区";i:130110;s:9:"鹿泉区";i:130111;s:9:"栾城区";i:130121;s:9:"井陉县";i:130123;s:9:"正定县";i:130125;s:9:"行唐县";i:130126;s:9:"灵寿县";i:130127;s:9:"高邑县";i:130128;s:9:"深泽县";i:130129;s:9:"赞皇县";i:130130;s:9:"无极县";i:130131;s:9:"平山县";i:130132;s:9:"元氏县";i:130133;s:6:"赵县";i:130181;s:9:"辛集市";i:130183;s:9:"晋州市";i:130184;s:9:"新乐市";i:130200;s:9:"唐山市";i:130202;s:9:"路南区";i:130203;s:9:"路北区";i:130204;s:9:"古冶区";i:130205;s:9:"开平区";i:130207;s:9:"丰南区";i:130208;s:9:"丰润区";i:130209;s:12:"曹妃甸区";i:130224;s:9:"滦南县";i:130225;s:9:"乐亭县";i:130227;s:9:"迁西县";i:130229;s:9:"玉田县";i:130281;s:9:"遵化市";i:130283;s:9:"迁安市";i:130284;s:9:"滦州市";i:130300;s:12:"秦皇岛市";i:130302;s:9:"海港区";i:130303;s:12:"山海关区";i:130304;s:12:"北戴河区";i:130306;s:9:"抚宁区";i:130321;s:21:"青龙满族自治县";i:130322;s:9:"昌黎县";i:130324;s:9:"卢龙县";i:130400;s:9:"邯郸市";i:130402;s:9:"邯山区";i:130403;s:9:"丛台区";i:130404;s:9:"复兴区";i:130406;s:12:"峰峰矿区";i:130407;s:9:"肥乡区";i:130408;s:9:"永年区";i:130423;s:9:"临漳县";i:130424;s:9:"成安县";i:130425;s:9:"大名县";i:130426;s:6:"涉县";i:130427;s:6:"磁县";i:130430;s:6:"邱县";i:130431;s:9:"鸡泽县";i:130432;s:9:"广平县";i:130433;s:9:"馆陶县";i:130434;s:6:"魏县";i:130435;s:9:"曲周县";i:130481;s:9:"武安市";i:130500;s:9:"邢台市";i:130502;s:9:"襄都区";i:130503;s:9:"信都区";i:130505;s:9:"任泽区";i:130506;s:9:"南和区";i:130522;s:9:"临城县";i:130523;s:9:"内丘县";i:130524;s:9:"柏乡县";i:130525;s:9:"隆尧县";i:130528;s:9:"宁晋县";i:130529;s:9:"巨鹿县";i:130530;s:9:"新河县";i:130531;s:9:"广宗县";i:130532;s:9:"平乡县";i:130533;s:6:"威县";i:130534;s:9:"清河县";i:130535;s:9:"临西县";i:130581;s:9:"南宫市";i:130582;s:9:"沙河市";i:130600;s:9:"保定市";i:130602;s:9:"竞秀区";i:130606;s:9:"莲池区";i:130607;s:9:"满城区";i:130608;s:9:"清苑区";i:130609;s:9:"徐水区";i:130623;s:9:"涞水县";i:130624;s:9:"阜平县";i:130626;s:9:"定兴县";i:130627;s:6:"唐县";i:130628;s:9:"高阳县";i:130629;s:9:"容城县";i:130630;s:9:"涞源县";i:130631;s:9:"望都县";i:130632;s:9:"安新县";i:130633;s:6:"易县";i:130634;s:9:"曲阳县";i:130635;s:6:"蠡县";i:130636;s:9:"顺平县";i:130637;s:9:"博野县";i:130638;s:6:"雄县";i:130681;s:9:"涿州市";i:130682;s:9:"定州市";i:130683;s:9:"安国市";i:130684;s:12:"高碑店市";i:130700;s:12:"张家口市";i:130702;s:9:"桥东区";i:130703;s:9:"桥西区";i:130705;s:9:"宣化区";i:130706;s:12:"下花园区";i:130708;s:9:"万全区";i:130709;s:9:"崇礼区";i:130722;s:9:"张北县";i:130723;s:9:"康保县";i:130724;s:9:"沽源县";i:130725;s:9:"尚义县";i:130726;s:6:"蔚县";i:130727;s:9:"阳原县";i:130728;s:9:"怀安县";i:130730;s:9:"怀来县";i:130731;s:9:"涿鹿县";i:130732;s:9:"赤城县";i:130800;s:9:"承德市";i:130802;s:9:"双桥区";i:130803;s:9:"双滦区";i:130804;s:18:"鹰手营子矿区";i:130821;s:9:"承德县";i:130822;s:9:"兴隆县";i:130824;s:9:"滦平县";i:130825;s:9:"隆化县";i:130826;s:21:"丰宁满族自治县";i:130827;s:21:"宽城满族自治县";i:130828;s:30:"围场满族蒙古族自治县";i:130881;s:9:"平泉市";i:130900;s:9:"沧州市";i:130902;s:9:"新华区";i:130903;s:9:"运河区";i:130921;s:6:"沧县";i:130922;s:6:"青县";i:130923;s:9:"东光县";i:130924;s:9:"海兴县";i:130925;s:9:"盐山县";i:130926;s:9:"肃宁县";i:130927;s:9:"南皮县";i:130928;s:9:"吴桥县";i:130929;s:6:"献县";i:130930;s:21:"孟村回族自治县";i:130981;s:9:"泊头市";i:130982;s:9:"任丘市";i:130983;s:9:"黄骅市";i:130984;s:9:"河间市";i:131000;s:9:"廊坊市";i:131002;s:9:"安次区";i:131003;s:9:"广阳区";i:131022;s:9:"固安县";i:131023;s:9:"永清县";i:131024;s:9:"香河县";i:131025;s:9:"大城县";i:131026;s:9:"文安县";i:131028;s:21:"大厂回族自治县";i:131081;s:9:"霸州市";i:131082;s:9:"三河市";i:131100;s:9:"衡水市";i:131102;s:9:"桃城区";i:131103;s:9:"冀州区";i:131121;s:9:"枣强县";i:131122;s:9:"武邑县";i:131123;s:9:"武强县";i:131124;s:9:"饶阳县";i:131125;s:9:"安平县";i:131126;s:9:"故城县";i:131127;s:6:"景县";i:131128;s:9:"阜城县";i:131182;s:9:"深州市";i:140000;s:9:"山西省";i:140100;s:9:"太原市";i:140105;s:9:"小店区";i:140106;s:9:"迎泽区";i:140107;s:12:"杏花岭区";i:140108;s:12:"尖草坪区";i:140109;s:12:"万柏林区";i:140110;s:9:"晋源区";i:140121;s:9:"清徐县";i:140122;s:9:"阳曲县";i:140123;s:9:"娄烦县";i:140181;s:9:"古交市";i:140200;s:9:"大同市";i:140212;s:9:"新荣区";i:140213;s:9:"平城区";i:140214;s:9:"云冈区";i:140215;s:9:"云州区";i:140221;s:9:"阳高县";i:140222;s:9:"天镇县";i:140223;s:9:"广灵县";i:140224;s:9:"灵丘县";i:140225;s:9:"浑源县";i:140226;s:9:"左云县";i:140300;s:9:"阳泉市";i:140302;s:6:"城区";i:140303;s:6:"矿区";i:140311;s:6:"郊区";i:140321;s:9:"平定县";i:140322;s:6:"盂县";i:140400;s:9:"长治市";i:140403;s:9:"潞州区";i:140404;s:9:"上党区";i:140405;s:9:"屯留区";i:140406;s:9:"潞城区";i:140423;s:9:"襄垣县";i:140425;s:9:"平顺县";i:140426;s:9:"黎城县";i:140427;s:9:"壶关县";i:140428;s:9:"长子县";i:140429;s:9:"武乡县";i:140430;s:6:"沁县";i:140431;s:9:"沁源县";i:140500;s:9:"晋城市";i:140502;s:6:"城区";i:140521;s:9:"沁水县";i:140522;s:9:"阳城县";i:140524;s:9:"陵川县";i:140525;s:9:"泽州县";i:140581;s:9:"高平市";i:140600;s:9:"朔州市";i:140602;s:9:"朔城区";i:140603;s:9:"平鲁区";i:140621;s:9:"山阴县";i:140622;s:6:"应县";i:140623;s:9:"右玉县";i:140681;s:9:"怀仁市";i:140700;s:9:"晋中市";i:140702;s:9:"榆次区";i:140703;s:9:"太谷区";i:140721;s:9:"榆社县";i:140722;s:9:"左权县";i:140723;s:9:"和顺县";i:140724;s:9:"昔阳县";i:140725;s:9:"寿阳县";i:140727;s:6:"祁县";i:140728;s:9:"平遥县";i:140729;s:9:"灵石县";i:140781;s:9:"介休市";i:140800;s:9:"运城市";i:140802;s:9:"盐湖区";i:140821;s:9:"临猗县";i:140822;s:9:"万荣县";i:140823;s:9:"闻喜县";i:140824;s:9:"稷山县";i:140825;s:9:"新绛县";i:140826;s:6:"绛县";i:140827;s:9:"垣曲县";i:140828;s:6:"夏县";i:140829;s:9:"平陆县";i:140830;s:9:"芮城县";i:140881;s:9:"永济市";i:140882;s:9:"河津市";i:140900;s:9:"忻州市";i:140902;s:9:"忻府区";i:140921;s:9:"定襄县";i:140922;s:9:"五台县";i:140923;s:6:"代县";i:140924;s:9:"繁峙县";i:140925;s:9:"宁武县";i:140926;s:9:"静乐县";i:140927;s:9:"神池县";i:140928;s:9:"五寨县";i:140929;s:9:"岢岚县";i:140930;s:9:"河曲县";i:140931;s:9:"保德县";i:140932;s:9:"偏关县";i:140981;s:9:"原平市";i:141000;s:9:"临汾市";i:141002;s:9:"尧都区";i:141021;s:9:"曲沃县";i:141022;s:9:"翼城县";i:141023;s:9:"襄汾县";i:141024;s:9:"洪洞县";i:141025;s:6:"古县";i:141026;s:9:"安泽县";i:141027;s:9:"浮山县";i:141028;s:6:"吉县";i:141029;s:9:"乡宁县";i:141030;s:9:"大宁县";i:141031;s:6:"隰县";i:141032;s:9:"永和县";i:141033;s:6:"蒲县";i:141034;s:9:"汾西县";i:141081;s:9:"侯马市";i:141082;s:9:"霍州市";i:141100;s:9:"吕梁市";i:141102;s:9:"离石区";i:141121;s:9:"文水县";i:141122;s:9:"交城县";i:141123;s:6:"兴县";i:141124;s:6:"临县";i:141125;s:9:"柳林县";i:141126;s:9:"石楼县";i:141127;s:6:"岚县";i:141128;s:9:"方山县";i:141129;s:9:"中阳县";i:141130;s:9:"交口县";i:141181;s:9:"孝义市";i:141182;s:9:"汾阳市";i:150000;s:18:"内蒙古自治区";i:150100;s:15:"呼和浩特市";i:150102;s:9:"新城区";i:150103;s:9:"回民区";i:150104;s:9:"玉泉区";i:150105;s:9:"赛罕区";i:150121;s:15:"土默特左旗";i:150122;s:12:"托克托县";i:150123;s:15:"和林格尔县";i:150124;s:12:"清水河县";i:150125;s:9:"武川县";i:150200;s:9:"包头市";i:150202;s:9:"东河区";i:150203;s:12:"昆都仑区";i:150204;s:9:"青山区";i:150205;s:9:"石拐区";i:150206;s:18:"白云鄂博矿区";i:150207;s:9:"九原区";i:150221;s:15:"土默特右旗";i:150222;s:9:"固阳县";i:150223;s:27:"达尔罕茂明安联合旗";i:150300;s:9:"乌海市";i:150302;s:12:"海勃湾区";i:150303;s:9:"海南区";i:150304;s:9:"乌达区";i:150400;s:9:"赤峰市";i:150402;s:9:"红山区";i:150403;s:12:"元宝山区";i:150404;s:9:"松山区";i:150421;s:18:"阿鲁科尔沁旗";i:150422;s:12:"巴林左旗";i:150423;s:12:"巴林右旗";i:150424;s:9:"林西县";i:150425;s:15:"克什克腾旗";i:150426;s:12:"翁牛特旗";i:150428;s:12:"喀喇沁旗";i:150429;s:9:"宁城县";i:150430;s:9:"敖汉旗";i:150500;s:9:"通辽市";i:150502;s:12:"科尔沁区";i:150521;s:21:"科尔沁左翼中旗";i:150522;s:21:"科尔沁左翼后旗";i:150523;s:9:"开鲁县";i:150524;s:9:"库伦旗";i:150525;s:9:"奈曼旗";i:150526;s:12:"扎鲁特旗";i:150581;s:15:"霍林郭勒市";i:150600;s:15:"鄂尔多斯市";i:150602;s:9:"东胜区";i:150603;s:12:"康巴什区";i:150621;s:12:"达拉特旗";i:150622;s:12:"准格尔旗";i:150623;s:15:"鄂托克前旗";i:150624;s:12:"鄂托克旗";i:150625;s:9:"杭锦旗";i:150626;s:9:"乌审旗";i:150627;s:15:"伊金霍洛旗";i:150700;s:15:"呼伦贝尔市";i:150702;s:12:"海拉尔区";i:150703;s:15:"扎赉诺尔区";i:150721;s:9:"阿荣旗";i:150722;s:33:"莫力达瓦达斡尔族自治旗";i:150723;s:18:"鄂伦春自治旗";i:150724;s:21:"鄂温克族自治旗";i:150725;s:15:"陈巴尔虎旗";i:150726;s:18:"新巴尔虎左旗";i:150727;s:18:"新巴尔虎右旗";i:150781;s:12:"满洲里市";i:150782;s:12:"牙克石市";i:150783;s:12:"扎兰屯市";i:150784;s:15:"额尔古纳市";i:150785;s:9:"根河市";i:150800;s:15:"巴彦淖尔市";i:150802;s:9:"临河区";i:150821;s:9:"五原县";i:150822;s:9:"磴口县";i:150823;s:15:"乌拉特前旗";i:150824;s:15:"乌拉特中旗";i:150825;s:15:"乌拉特后旗";i:150826;s:12:"杭锦后旗";i:150900;s:15:"乌兰察布市";i:150902;s:9:"集宁区";i:150921;s:9:"卓资县";i:150922;s:9:"化德县";i:150923;s:9:"商都县";i:150924;s:9:"兴和县";i:150925;s:9:"凉城县";i:150926;s:21:"察哈尔右翼前旗";i:150927;s:21:"察哈尔右翼中旗";i:150928;s:21:"察哈尔右翼后旗";i:150929;s:12:"四子王旗";i:150981;s:9:"丰镇市";i:152200;s:9:"兴安盟";i:152201;s:15:"乌兰浩特市";i:152202;s:12:"阿尔山市";i:152221;s:21:"科尔沁右翼前旗";i:152222;s:21:"科尔沁右翼中旗";i:152223;s:12:"扎赉特旗";i:152224;s:9:"突泉县";i:152500;s:15:"锡林郭勒盟";i:152501;s:15:"二连浩特市";i:152502;s:15:"锡林浩特市";i:152522;s:12:"阿巴嘎旗";i:152523;s:15:"苏尼特左旗";i:152524;s:15:"苏尼特右旗";i:152525;s:18:"东乌珠穆沁旗";i:152526;s:18:"西乌珠穆沁旗";i:152527;s:12:"太仆寺旗";i:152528;s:9:"镶黄旗";i:152529;s:12:"正镶白旗";i:152530;s:9:"正蓝旗";i:152531;s:9:"多伦县";i:152900;s:12:"阿拉善盟";i:152921;s:15:"阿拉善左旗";i:152922;s:15:"阿拉善右旗";i:152923;s:12:"额济纳旗";i:210000;s:9:"辽宁省";i:210100;s:9:"沈阳市";i:210102;s:9:"和平区";i:210103;s:9:"沈河区";i:210104;s:9:"大东区";i:210105;s:9:"皇姑区";i:210106;s:9:"铁西区";i:210111;s:12:"苏家屯区";i:210112;s:9:"浑南区";i:210113;s:12:"沈北新区";i:210114;s:9:"于洪区";i:210115;s:9:"辽中区";i:210123;s:9:"康平县";i:210124;s:9:"法库县";i:210181;s:9:"新民市";i:210200;s:9:"大连市";i:210202;s:9:"中山区";i:210203;s:9:"西岗区";i:210204;s:12:"沙河口区";i:210211;s:12:"甘井子区";i:210212;s:12:"旅顺口区";i:210213;s:9:"金州区";i:210214;s:12:"普兰店区";i:210224;s:9:"长海县";i:210281;s:12:"瓦房店市";i:210283;s:9:"庄河市";i:210300;s:9:"鞍山市";i:210302;s:9:"铁东区";i:210303;s:9:"铁西区";i:210304;s:9:"立山区";i:210311;s:9:"千山区";i:210321;s:9:"台安县";i:210323;s:21:"岫岩满族自治县";i:210381;s:9:"海城市";i:210400;s:9:"抚顺市";i:210402;s:9:"新抚区";i:210403;s:9:"东洲区";i:210404;s:9:"望花区";i:210411;s:9:"顺城区";i:210421;s:9:"抚顺县";i:210422;s:21:"新宾满族自治县";i:210423;s:21:"清原满族自治县";i:210500;s:9:"本溪市";i:210502;s:9:"平山区";i:210503;s:9:"溪湖区";i:210504;s:9:"明山区";i:210505;s:9:"南芬区";i:210521;s:21:"本溪满族自治县";i:210522;s:21:"桓仁满族自治县";i:210600;s:9:"丹东市";i:210602;s:9:"元宝区";i:210603;s:9:"振兴区";i:210604;s:9:"振安区";i:210624;s:21:"宽甸满族自治县";i:210681;s:9:"东港市";i:210682;s:9:"凤城市";i:210700;s:9:"锦州市";i:210702;s:9:"古塔区";i:210703;s:9:"凌河区";i:210711;s:9:"太和区";i:210726;s:9:"黑山县";i:210727;s:6:"义县";i:210781;s:9:"凌海市";i:210782;s:9:"北镇市";i:210800;s:9:"营口市";i:210802;s:9:"站前区";i:210803;s:9:"西市区";i:210804;s:12:"鲅鱼圈区";i:210811;s:9:"老边区";i:210881;s:9:"盖州市";i:210882;s:12:"大石桥市";i:210900;s:9:"阜新市";i:210902;s:9:"海州区";i:210903;s:9:"新邱区";i:210904;s:9:"太平区";i:210905;s:12:"清河门区";i:210911;s:9:"细河区";i:210921;s:24:"阜新蒙古族自治县";i:210922;s:9:"彰武县";i:211000;s:9:"辽阳市";i:211002;s:9:"白塔区";i:211003;s:9:"文圣区";i:211004;s:9:"宏伟区";i:211005;s:12:"弓长岭区";i:211011;s:12:"太子河区";i:211021;s:9:"辽阳县";i:211081;s:9:"灯塔市";i:211100;s:9:"盘锦市";i:211102;s:12:"双台子区";i:211103;s:12:"兴隆台区";i:211104;s:9:"大洼区";i:211122;s:9:"盘山县";i:211200;s:9:"铁岭市";i:211202;s:9:"银州区";i:211204;s:9:"清河区";i:211221;s:9:"铁岭县";i:211223;s:9:"西丰县";i:211224;s:9:"昌图县";i:211281;s:12:"调兵山市";i:211282;s:9:"开原市";i:211300;s:9:"朝阳市";i:211302;s:9:"双塔区";i:211303;s:9:"龙城区";i:211321;s:9:"朝阳县";i:211322;s:9:"建平县";i:211324;s:33:"喀喇沁左翼蒙古族自治县";i:211381;s:9:"北票市";i:211382;s:9:"凌源市";i:211400;s:12:"葫芦岛市";i:211402;s:9:"连山区";i:211403;s:9:"龙港区";i:211404;s:9:"南票区";i:211421;s:9:"绥中县";i:211422;s:9:"建昌县";i:211481;s:9:"兴城市";i:220000;s:9:"吉林省";i:220100;s:9:"长春市";i:220102;s:9:"南关区";i:220103;s:9:"宽城区";i:220104;s:9:"朝阳区";i:220105;s:9:"二道区";i:220106;s:9:"绿园区";i:220112;s:9:"双阳区";i:220113;s:9:"九台区";i:220122;s:9:"农安县";i:220182;s:9:"榆树市";i:220183;s:9:"德惠市";i:220184;s:12:"公主岭市";i:220200;s:9:"吉林市";i:220202;s:9:"昌邑区";i:220203;s:9:"龙潭区";i:220204;s:9:"船营区";i:220211;s:9:"丰满区";i:220221;s:9:"永吉县";i:220281;s:9:"蛟河市";i:220282;s:9:"桦甸市";i:220283;s:9:"舒兰市";i:220284;s:9:"磐石市";i:220300;s:9:"四平市";i:220302;s:9:"铁西区";i:220303;s:9:"铁东区";i:220322;s:9:"梨树县";i:220323;s:21:"伊通满族自治县";i:220382;s:9:"双辽市";i:220400;s:9:"辽源市";i:220402;s:9:"龙山区";i:220403;s:9:"西安区";i:220421;s:9:"东丰县";i:220422;s:9:"东辽县";i:220500;s:9:"通化市";i:220502;s:9:"东昌区";i:220503;s:12:"二道江区";i:220521;s:9:"通化县";i:220523;s:9:"辉南县";i:220524;s:9:"柳河县";i:220581;s:12:"梅河口市";i:220582;s:9:"集安市";i:220600;s:9:"白山市";i:220602;s:9:"浑江区";i:220605;s:9:"江源区";i:220621;s:9:"抚松县";i:220622;s:9:"靖宇县";i:220623;s:24:"长白朝鲜族自治县";i:220681;s:9:"临江市";i:220700;s:9:"松原市";i:220702;s:9:"宁江区";i:220721;s:33:"前郭尔罗斯蒙古族自治县";i:220722;s:9:"长岭县";i:220723;s:9:"乾安县";i:220781;s:9:"扶余市";i:220800;s:9:"白城市";i:220802;s:9:"洮北区";i:220821;s:9:"镇赉县";i:220822;s:9:"通榆县";i:220881;s:9:"洮南市";i:220882;s:9:"大安市";i:222400;s:24:"延边朝鲜族自治州";i:222401;s:9:"延吉市";i:222402;s:9:"图们市";i:222403;s:9:"敦化市";i:222404;s:9:"珲春市";i:222405;s:9:"龙井市";i:222406;s:9:"和龙市";i:222424;s:9:"汪清县";i:222426;s:9:"安图县";i:230000;s:12:"黑龙江省";i:230100;s:12:"哈尔滨市";i:230102;s:9:"道里区";i:230103;s:9:"南岗区";i:230104;s:9:"道外区";i:230108;s:9:"平房区";i:230109;s:9:"松北区";i:230110;s:9:"香坊区";i:230111;s:9:"呼兰区";i:230112;s:9:"阿城区";i:230113;s:9:"双城区";i:230123;s:9:"依兰县";i:230124;s:9:"方正县";i:230125;s:6:"宾县";i:230126;s:9:"巴彦县";i:230127;s:9:"木兰县";i:230128;s:9:"通河县";i:230129;s:9:"延寿县";i:230183;s:9:"尚志市";i:230184;s:9:"五常市";i:230200;s:15:"齐齐哈尔市";i:230202;s:9:"龙沙区";i:230203;s:9:"建华区";i:230204;s:9:"铁锋区";i:230205;s:12:"昂昂溪区";i:230206;s:15:"富拉尔基区";i:230207;s:12:"碾子山区";i:230208;s:24:"梅里斯达斡尔族区";i:230221;s:9:"龙江县";i:230223;s:9:"依安县";i:230224;s:9:"泰来县";i:230225;s:9:"甘南县";i:230227;s:9:"富裕县";i:230229;s:9:"克山县";i:230230;s:9:"克东县";i:230231;s:9:"拜泉县";i:230281;s:9:"讷河市";i:230300;s:9:"鸡西市";i:230302;s:9:"鸡冠区";i:230303;s:9:"恒山区";i:230304;s:9:"滴道区";i:230305;s:9:"梨树区";i:230306;s:12:"城子河区";i:230307;s:9:"麻山区";i:230321;s:9:"鸡东县";i:230381;s:9:"虎林市";i:230382;s:9:"密山市";i:230400;s:9:"鹤岗市";i:230402;s:9:"向阳区";i:230403;s:9:"工农区";i:230404;s:9:"南山区";i:230405;s:9:"兴安区";i:230406;s:9:"东山区";i:230407;s:9:"兴山区";i:230421;s:9:"萝北县";i:230422;s:9:"绥滨县";i:230500;s:12:"双鸭山市";i:230502;s:9:"尖山区";i:230503;s:9:"岭东区";i:230505;s:12:"四方台区";i:230506;s:9:"宝山区";i:230521;s:9:"集贤县";i:230522;s:9:"友谊县";i:230523;s:9:"宝清县";i:230524;s:9:"饶河县";i:230600;s:9:"大庆市";i:230602;s:12:"萨尔图区";i:230603;s:9:"龙凤区";i:230604;s:12:"让胡路区";i:230605;s:9:"红岗区";i:230606;s:9:"大同区";i:230621;s:9:"肇州县";i:230622;s:9:"肇源县";i:230623;s:9:"林甸县";i:230624;s:30:"杜尔伯特蒙古族自治县";i:230700;s:9:"伊春市";i:230717;s:9:"伊美区";i:230718;s:9:"乌翠区";i:230719;s:9:"友好区";i:230722;s:9:"嘉荫县";i:230723;s:9:"汤旺县";i:230724;s:9:"丰林县";i:230725;s:12:"大箐山县";i:230726;s:9:"南岔县";i:230751;s:9:"金林区";i:230781;s:9:"铁力市";i:230800;s:12:"佳木斯市";i:230803;s:9:"向阳区";i:230804;s:9:"前进区";i:230805;s:9:"东风区";i:230811;s:6:"郊区";i:230822;s:9:"桦南县";i:230826;s:9:"桦川县";i:230828;s:9:"汤原县";i:230881;s:9:"同江市";i:230882;s:9:"富锦市";i:230883;s:9:"抚远市";i:230900;s:12:"七台河市";i:230902;s:9:"新兴区";i:230903;s:9:"桃山区";i:230904;s:12:"茄子河区";i:230921;s:9:"勃利县";i:231000;s:12:"牡丹江市";i:231002;s:9:"东安区";i:231003;s:9:"阳明区";i:231004;s:9:"爱民区";i:231005;s:9:"西安区";i:231025;s:9:"林口县";i:231081;s:12:"绥芬河市";i:231083;s:9:"海林市";i:231084;s:9:"宁安市";i:231085;s:9:"穆棱市";i:231086;s:9:"东宁市";i:231100;s:9:"黑河市";i:231102;s:9:"爱辉区";i:231123;s:9:"逊克县";i:231124;s:9:"孙吴县";i:231181;s:9:"北安市";i:231182;s:15:"五大连池市";i:231183;s:9:"嫩江市";i:231200;s:9:"绥化市";i:231202;s:9:"北林区";i:231221;s:9:"望奎县";i:231222;s:9:"兰西县";i:231223;s:9:"青冈县";i:231224;s:9:"庆安县";i:231225;s:9:"明水县";i:231226;s:9:"绥棱县";i:231281;s:9:"安达市";i:231282;s:9:"肇东市";i:231283;s:9:"海伦市";i:232700;s:18:"大兴安岭地区";i:232701;s:9:"漠河市";i:232721;s:9:"呼玛县";i:232722;s:9:"塔河县";i:310000;s:9:"上海市";i:310101;s:9:"黄浦区";i:310104;s:9:"徐汇区";i:310105;s:9:"长宁区";i:310106;s:9:"静安区";i:310107;s:9:"普陀区";i:310109;s:9:"虹口区";i:310110;s:9:"杨浦区";i:310112;s:9:"闵行区";i:310113;s:9:"宝山区";i:310114;s:9:"嘉定区";i:310115;s:12:"浦东新区";i:310116;s:9:"金山区";i:310117;s:9:"松江区";i:310118;s:9:"青浦区";i:310120;s:9:"奉贤区";i:310151;s:9:"崇明区";i:320000;s:9:"江苏省";i:320100;s:9:"南京市";i:320102;s:9:"玄武区";i:320104;s:9:"秦淮区";i:320105;s:9:"建邺区";i:320106;s:9:"鼓楼区";i:320111;s:9:"浦口区";i:320113;s:9:"栖霞区";i:320114;s:12:"雨花台区";i:320115;s:9:"江宁区";i:320116;s:9:"六合区";i:320117;s:9:"溧水区";i:320118;s:9:"高淳区";i:320200;s:9:"无锡市";i:320205;s:9:"锡山区";i:320206;s:9:"惠山区";i:320211;s:9:"滨湖区";i:320213;s:9:"梁溪区";i:320214;s:9:"新吴区";i:320281;s:9:"江阴市";i:320282;s:9:"宜兴市";i:320300;s:9:"徐州市";i:320302;s:9:"鼓楼区";i:320303;s:9:"云龙区";i:320305;s:9:"贾汪区";i:320311;s:9:"泉山区";i:320312;s:9:"铜山区";i:320321;s:6:"丰县";i:320322;s:6:"沛县";i:320324;s:9:"睢宁县";i:320381;s:9:"新沂市";i:320382;s:9:"邳州市";i:320400;s:9:"常州市";i:320402;s:9:"天宁区";i:320404;s:9:"钟楼区";i:320411;s:9:"新北区";i:320412;s:9:"武进区";i:320413;s:9:"金坛区";i:320481;s:9:"溧阳市";i:320500;s:9:"苏州市";i:320505;s:9:"虎丘区";i:320506;s:9:"吴中区";i:320507;s:9:"相城区";i:320508;s:9:"姑苏区";i:320509;s:9:"吴江区";i:320581;s:9:"常熟市";i:320582;s:12:"张家港市";i:320583;s:9:"昆山市";i:320585;s:9:"太仓市";i:320600;s:9:"南通市";i:320612;s:9:"通州区";i:320613;s:9:"崇川区";i:320614;s:9:"海门区";i:320623;s:9:"如东县";i:320681;s:9:"启东市";i:320682;s:9:"如皋市";i:320685;s:9:"海安市";i:320700;s:12:"连云港市";i:320703;s:9:"连云区";i:320706;s:9:"海州区";i:320707;s:9:"赣榆区";i:320722;s:9:"东海县";i:320723;s:9:"灌云县";i:320724;s:9:"灌南县";i:320800;s:9:"淮安市";i:320803;s:9:"淮安区";i:320804;s:9:"淮阴区";i:320812;s:12:"清江浦区";i:320813;s:9:"洪泽区";i:320826;s:9:"涟水县";i:320830;s:9:"盱眙县";i:320831;s:9:"金湖县";i:320900;s:9:"盐城市";i:320902;s:9:"亭湖区";i:320903;s:9:"盐都区";i:320904;s:9:"大丰区";i:320921;s:9:"响水县";i:320922;s:9:"滨海县";i:320923;s:9:"阜宁县";i:320924;s:9:"射阳县";i:320925;s:9:"建湖县";i:320981;s:9:"东台市";i:321000;s:9:"扬州市";i:321002;s:9:"广陵区";i:321003;s:9:"邗江区";i:321012;s:9:"江都区";i:321023;s:9:"宝应县";i:321081;s:9:"仪征市";i:321084;s:9:"高邮市";i:321100;s:9:"镇江市";i:321102;s:9:"京口区";i:321111;s:9:"润州区";i:321112;s:9:"丹徒区";i:321181;s:9:"丹阳市";i:321182;s:9:"扬中市";i:321183;s:9:"句容市";i:321200;s:9:"泰州市";i:321202;s:9:"海陵区";i:321203;s:9:"高港区";i:321204;s:9:"姜堰区";i:321281;s:9:"兴化市";i:321282;s:9:"靖江市";i:321283;s:9:"泰兴市";i:321300;s:9:"宿迁市";i:321302;s:9:"宿城区";i:321311;s:9:"宿豫区";i:321322;s:9:"沭阳县";i:321323;s:9:"泗阳县";i:321324;s:9:"泗洪县";i:330000;s:9:"浙江省";i:330100;s:9:"杭州市";i:330102;s:9:"上城区";i:330103;s:9:"下城区";i:330104;s:9:"江干区";i:330105;s:9:"拱墅区";i:330106;s:9:"西湖区";i:330108;s:9:"滨江区";i:330109;s:9:"萧山区";i:330110;s:9:"余杭区";i:330111;s:9:"富阳区";i:330112;s:9:"临安区";i:330122;s:9:"桐庐县";i:330127;s:9:"淳安县";i:330182;s:9:"建德市";i:330200;s:9:"宁波市";i:330203;s:9:"海曙区";i:330205;s:9:"江北区";i:330206;s:9:"北仑区";i:330211;s:9:"镇海区";i:330212;s:9:"鄞州区";i:330213;s:9:"奉化区";i:330225;s:9:"象山县";i:330226;s:9:"宁海县";i:330281;s:9:"余姚市";i:330282;s:9:"慈溪市";i:330300;s:9:"温州市";i:330302;s:9:"鹿城区";i:330303;s:9:"龙湾区";i:330304;s:9:"瓯海区";i:330305;s:9:"洞头区";i:330324;s:9:"永嘉县";i:330326;s:9:"平阳县";i:330327;s:9:"苍南县";i:330328;s:9:"文成县";i:330329;s:9:"泰顺县";i:330381;s:9:"瑞安市";i:330382;s:9:"乐清市";i:330383;s:9:"龙港市";i:330400;s:9:"嘉兴市";i:330402;s:9:"南湖区";i:330411;s:9:"秀洲区";i:330421;s:9:"嘉善县";i:330424;s:9:"海盐县";i:330481;s:9:"海宁市";i:330482;s:9:"平湖市";i:330483;s:9:"桐乡市";i:330500;s:9:"湖州市";i:330502;s:9:"吴兴区";i:330503;s:9:"南浔区";i:330521;s:9:"德清县";i:330522;s:9:"长兴县";i:330523;s:9:"安吉县";i:330600;s:9:"绍兴市";i:330602;s:9:"越城区";i:330603;s:9:"柯桥区";i:330604;s:9:"上虞区";i:330624;s:9:"新昌县";i:330681;s:9:"诸暨市";i:330683;s:9:"嵊州市";i:330700;s:9:"金华市";i:330702;s:9:"婺城区";i:330703;s:9:"金东区";i:330723;s:9:"武义县";i:330726;s:9:"浦江县";i:330727;s:9:"磐安县";i:330781;s:9:"兰溪市";i:330782;s:9:"义乌市";i:330783;s:9:"东阳市";i:330784;s:9:"永康市";i:330800;s:9:"衢州市";i:330802;s:9:"柯城区";i:330803;s:9:"衢江区";i:330822;s:9:"常山县";i:330824;s:9:"开化县";i:330825;s:9:"龙游县";i:330881;s:9:"江山市";i:330900;s:9:"舟山市";i:330902;s:9:"定海区";i:330903;s:9:"普陀区";i:330921;s:9:"岱山县";i:330922;s:9:"嵊泗县";i:331000;s:9:"台州市";i:331002;s:9:"椒江区";i:331003;s:9:"黄岩区";i:331004;s:9:"路桥区";i:331022;s:9:"三门县";i:331023;s:9:"天台县";i:331024;s:9:"仙居县";i:331081;s:9:"温岭市";i:331082;s:9:"临海市";i:331083;s:9:"玉环市";i:331100;s:9:"丽水市";i:331102;s:9:"莲都区";i:331121;s:9:"青田县";i:331122;s:9:"缙云县";i:331123;s:9:"遂昌县";i:331124;s:9:"松阳县";i:331125;s:9:"云和县";i:331126;s:9:"庆元县";i:331127;s:21:"景宁畲族自治县";i:331181;s:9:"龙泉市";i:340000;s:9:"安徽省";i:340100;s:9:"合肥市";i:340102;s:9:"瑶海区";i:340103;s:9:"庐阳区";i:340104;s:9:"蜀山区";i:340111;s:9:"包河区";i:340121;s:9:"长丰县";i:340122;s:9:"肥东县";i:340123;s:9:"肥西县";i:340124;s:9:"庐江县";i:340181;s:9:"巢湖市";i:340200;s:9:"芜湖市";i:340202;s:9:"镜湖区";i:340207;s:9:"鸠江区";i:340209;s:9:"弋江区";i:340210;s:9:"湾沚区";i:340212;s:9:"繁昌区";i:340223;s:9:"南陵县";i:340281;s:9:"无为市";i:340300;s:9:"蚌埠市";i:340302;s:12:"龙子湖区";i:340303;s:9:"蚌山区";i:340304;s:9:"禹会区";i:340311;s:9:"淮上区";i:340321;s:9:"怀远县";i:340322;s:9:"五河县";i:340323;s:9:"固镇县";i:340400;s:9:"淮南市";i:340402;s:9:"大通区";i:340403;s:12:"田家庵区";i:340404;s:12:"谢家集区";i:340405;s:12:"八公山区";i:340406;s:9:"潘集区";i:340421;s:9:"凤台县";i:340422;s:6:"寿县";i:340500;s:12:"马鞍山市";i:340503;s:9:"花山区";i:340504;s:9:"雨山区";i:340506;s:9:"博望区";i:340521;s:9:"当涂县";i:340522;s:9:"含山县";i:340523;s:6:"和县";i:340600;s:9:"淮北市";i:340602;s:9:"杜集区";i:340603;s:9:"相山区";i:340604;s:9:"烈山区";i:340621;s:9:"濉溪县";i:340700;s:9:"铜陵市";i:340705;s:9:"铜官区";i:340706;s:9:"义安区";i:340711;s:6:"郊区";i:340722;s:9:"枞阳县";i:340800;s:9:"安庆市";i:340802;s:9:"迎江区";i:340803;s:9:"大观区";i:340811;s:9:"宜秀区";i:340822;s:9:"怀宁县";i:340825;s:9:"太湖县";i:340826;s:9:"宿松县";i:340827;s:9:"望江县";i:340828;s:9:"岳西县";i:340881;s:9:"桐城市";i:340882;s:9:"潜山市";i:341000;s:9:"黄山市";i:341002;s:9:"屯溪区";i:341003;s:9:"黄山区";i:341004;s:9:"徽州区";i:341021;s:6:"歙县";i:341022;s:9:"休宁县";i:341023;s:6:"黟县";i:341024;s:9:"祁门县";i:341100;s:9:"滁州市";i:341102;s:9:"琅琊区";i:341103;s:9:"南谯区";i:341122;s:9:"来安县";i:341124;s:9:"全椒县";i:341125;s:9:"定远县";i:341126;s:9:"凤阳县";i:341181;s:9:"天长市";i:341182;s:9:"明光市";i:341200;s:9:"阜阳市";i:341202;s:9:"颍州区";i:341203;s:9:"颍东区";i:341204;s:9:"颍泉区";i:341221;s:9:"临泉县";i:341222;s:9:"太和县";i:341225;s:9:"阜南县";i:341226;s:9:"颍上县";i:341282;s:9:"界首市";i:341300;s:9:"宿州市";i:341302;s:9:"埇桥区";i:341321;s:9:"砀山县";i:341322;s:6:"萧县";i:341323;s:9:"灵璧县";i:341324;s:6:"泗县";i:341500;s:9:"六安市";i:341502;s:9:"金安区";i:341503;s:9:"裕安区";i:341504;s:9:"叶集区";i:341522;s:9:"霍邱县";i:341523;s:9:"舒城县";i:341524;s:9:"金寨县";i:341525;s:9:"霍山县";i:341600;s:9:"亳州市";i:341602;s:9:"谯城区";i:341621;s:9:"涡阳县";i:341622;s:9:"蒙城县";i:341623;s:9:"利辛县";i:341700;s:9:"池州市";i:341702;s:9:"贵池区";i:341721;s:9:"东至县";i:341722;s:9:"石台县";i:341723;s:9:"青阳县";i:341800;s:9:"宣城市";i:341802;s:9:"宣州区";i:341821;s:9:"郎溪县";i:341823;s:6:"泾县";i:341824;s:9:"绩溪县";i:341825;s:9:"旌德县";i:341881;s:9:"宁国市";i:341882;s:9:"广德市";i:350000;s:9:"福建省";i:350100;s:9:"福州市";i:350102;s:9:"鼓楼区";i:350103;s:9:"台江区";i:350104;s:9:"仓山区";i:350105;s:9:"马尾区";i:350111;s:9:"晋安区";i:350112;s:9:"长乐区";i:350121;s:9:"闽侯县";i:350122;s:9:"连江县";i:350123;s:9:"罗源县";i:350124;s:9:"闽清县";i:350125;s:9:"永泰县";i:350128;s:9:"平潭县";i:350181;s:9:"福清市";i:350200;s:9:"厦门市";i:350203;s:9:"思明区";i:350205;s:9:"海沧区";i:350206;s:9:"湖里区";i:350211;s:9:"集美区";i:350212;s:9:"同安区";i:350213;s:9:"翔安区";i:350300;s:9:"莆田市";i:350302;s:9:"城厢区";i:350303;s:9:"涵江区";i:350304;s:9:"荔城区";i:350305;s:9:"秀屿区";i:350322;s:9:"仙游县";i:350400;s:9:"三明市";i:350402;s:9:"梅列区";i:350403;s:9:"三元区";i:350421;s:9:"明溪县";i:350423;s:9:"清流县";i:350424;s:9:"宁化县";i:350425;s:9:"大田县";i:350426;s:9:"尤溪县";i:350427;s:6:"沙县";i:350428;s:9:"将乐县";i:350429;s:9:"泰宁县";i:350430;s:9:"建宁县";i:350481;s:9:"永安市";i:350500;s:9:"泉州市";i:350502;s:9:"鲤城区";i:350503;s:9:"丰泽区";i:350504;s:9:"洛江区";i:350505;s:9:"泉港区";i:350521;s:9:"惠安县";i:350524;s:9:"安溪县";i:350525;s:9:"永春县";i:350526;s:9:"德化县";i:350527;s:9:"金门县";i:350581;s:9:"石狮市";i:350582;s:9:"晋江市";i:350583;s:9:"南安市";i:350600;s:9:"漳州市";i:350602;s:9:"芗城区";i:350603;s:9:"龙文区";i:350622;s:9:"云霄县";i:350623;s:9:"漳浦县";i:350624;s:9:"诏安县";i:350625;s:9:"长泰县";i:350626;s:9:"东山县";i:350627;s:9:"南靖县";i:350628;s:9:"平和县";i:350629;s:9:"华安县";i:350681;s:9:"龙海市";i:350700;s:9:"南平市";i:350702;s:9:"延平区";i:350703;s:9:"建阳区";i:350721;s:9:"顺昌县";i:350722;s:9:"浦城县";i:350723;s:9:"光泽县";i:350724;s:9:"松溪县";i:350725;s:9:"政和县";i:350781;s:9:"邵武市";i:350782;s:12:"武夷山市";i:350783;s:9:"建瓯市";i:350800;s:9:"龙岩市";i:350802;s:9:"新罗区";i:350803;s:9:"永定区";i:350821;s:9:"长汀县";i:350823;s:9:"上杭县";i:350824;s:9:"武平县";i:350825;s:9:"连城县";i:350881;s:9:"漳平市";i:350900;s:9:"宁德市";i:350902;s:9:"蕉城区";i:350921;s:9:"霞浦县";i:350922;s:9:"古田县";i:350923;s:9:"屏南县";i:350924;s:9:"寿宁县";i:350925;s:9:"周宁县";i:350926;s:9:"柘荣县";i:350981;s:9:"福安市";i:350982;s:9:"福鼎市";i:360000;s:9:"江西省";i:360100;s:9:"南昌市";i:360102;s:9:"东湖区";i:360103;s:9:"西湖区";i:360104;s:12:"青云谱区";i:360111;s:12:"青山湖区";i:360112;s:9:"新建区";i:360113;s:12:"红谷滩区";i:360121;s:9:"南昌县";i:360123;s:9:"安义县";i:360124;s:9:"进贤县";i:360200;s:12:"景德镇市";i:360202;s:9:"昌江区";i:360203;s:9:"珠山区";i:360222;s:9:"浮梁县";i:360281;s:9:"乐平市";i:360300;s:9:"萍乡市";i:360302;s:9:"安源区";i:360313;s:9:"湘东区";i:360321;s:9:"莲花县";i:360322;s:9:"上栗县";i:360323;s:9:"芦溪县";i:360400;s:9:"九江市";i:360402;s:9:"濂溪区";i:360403;s:9:"浔阳区";i:360404;s:9:"柴桑区";i:360423;s:9:"武宁县";i:360424;s:9:"修水县";i:360425;s:9:"永修县";i:360426;s:9:"德安县";i:360428;s:9:"都昌县";i:360429;s:9:"湖口县";i:360430;s:9:"彭泽县";i:360481;s:9:"瑞昌市";i:360482;s:12:"共青城市";i:360483;s:9:"庐山市";i:360500;s:9:"新余市";i:360502;s:9:"渝水区";i:360521;s:9:"分宜县";i:360600;s:9:"鹰潭市";i:360602;s:9:"月湖区";i:360603;s:9:"余江区";i:360681;s:9:"贵溪市";i:360700;s:9:"赣州市";i:360702;s:9:"章贡区";i:360703;s:9:"南康区";i:360704;s:9:"赣县区";i:360722;s:9:"信丰县";i:360723;s:9:"大余县";i:360724;s:9:"上犹县";i:360725;s:9:"崇义县";i:360726;s:9:"安远县";i:360728;s:9:"定南县";i:360729;s:9:"全南县";i:360730;s:9:"宁都县";i:360731;s:9:"于都县";i:360732;s:9:"兴国县";i:360733;s:9:"会昌县";i:360734;s:9:"寻乌县";i:360735;s:9:"石城县";i:360781;s:9:"瑞金市";i:360783;s:9:"龙南市";i:360800;s:9:"吉安市";i:360802;s:9:"吉州区";i:360803;s:9:"青原区";i:360821;s:9:"吉安县";i:360822;s:9:"吉水县";i:360823;s:9:"峡江县";i:360824;s:9:"新干县";i:360825;s:9:"永丰县";i:360826;s:9:"泰和县";i:360827;s:9:"遂川县";i:360828;s:9:"万安县";i:360829;s:9:"安福县";i:360830;s:9:"永新县";i:360881;s:12:"井冈山市";i:360900;s:9:"宜春市";i:360902;s:9:"袁州区";i:360921;s:9:"奉新县";i:360922;s:9:"万载县";i:360923;s:9:"上高县";i:360924;s:9:"宜丰县";i:360925;s:9:"靖安县";i:360926;s:9:"铜鼓县";i:360981;s:9:"丰城市";i:360982;s:9:"樟树市";i:360983;s:9:"高安市";i:361000;s:9:"抚州市";i:361002;s:9:"临川区";i:361003;s:9:"东乡区";i:361021;s:9:"南城县";i:361022;s:9:"黎川县";i:361023;s:9:"南丰县";i:361024;s:9:"崇仁县";i:361025;s:9:"乐安县";i:361026;s:9:"宜黄县";i:361027;s:9:"金溪县";i:361028;s:9:"资溪县";i:361030;s:9:"广昌县";i:361100;s:9:"上饶市";i:361102;s:9:"信州区";i:361103;s:9:"广丰区";i:361104;s:9:"广信区";i:361123;s:9:"玉山县";i:361124;s:9:"铅山县";i:361125;s:9:"横峰县";i:361126;s:9:"弋阳县";i:361127;s:9:"余干县";i:361128;s:9:"鄱阳县";i:361129;s:9:"万年县";i:361130;s:9:"婺源县";i:361181;s:9:"德兴市";i:370000;s:9:"山东省";i:370100;s:9:"济南市";i:370102;s:9:"历下区";i:370103;s:9:"市中区";i:370104;s:9:"槐荫区";i:370105;s:9:"天桥区";i:370112;s:9:"历城区";i:370113;s:9:"长清区";i:370114;s:9:"章丘区";i:370115;s:9:"济阳区";i:370116;s:9:"莱芜区";i:370117;s:9:"钢城区";i:370124;s:9:"平阴县";i:370126;s:9:"商河县";i:370200;s:9:"青岛市";i:370202;s:9:"市南区";i:370203;s:9:"市北区";i:370211;s:9:"黄岛区";i:370212;s:9:"崂山区";i:370213;s:9:"李沧区";i:370214;s:9:"城阳区";i:370215;s:9:"即墨区";i:370281;s:9:"胶州市";i:370283;s:9:"平度市";i:370285;s:9:"莱西市";i:370300;s:9:"淄博市";i:370302;s:9:"淄川区";i:370303;s:9:"张店区";i:370304;s:9:"博山区";i:370305;s:9:"临淄区";i:370306;s:9:"周村区";i:370321;s:9:"桓台县";i:370322;s:9:"高青县";i:370323;s:9:"沂源县";i:370400;s:9:"枣庄市";i:370402;s:9:"市中区";i:370403;s:9:"薛城区";i:370404;s:9:"峄城区";i:370405;s:12:"台儿庄区";i:370406;s:9:"山亭区";i:370481;s:9:"滕州市";i:370500;s:9:"东营市";i:370502;s:9:"东营区";i:370503;s:9:"河口区";i:370505;s:9:"垦利区";i:370522;s:9:"利津县";i:370523;s:9:"广饶县";i:370600;s:9:"烟台市";i:370602;s:9:"芝罘区";i:370611;s:9:"福山区";i:370612;s:9:"牟平区";i:370613;s:9:"莱山区";i:370614;s:9:"蓬莱区";i:370681;s:9:"龙口市";i:370682;s:9:"莱阳市";i:370683;s:9:"莱州市";i:370685;s:9:"招远市";i:370686;s:9:"栖霞市";i:370687;s:9:"海阳市";i:370700;s:9:"潍坊市";i:370702;s:9:"潍城区";i:370703;s:9:"寒亭区";i:370704;s:9:"坊子区";i:370705;s:9:"奎文区";i:370724;s:9:"临朐县";i:370725;s:9:"昌乐县";i:370781;s:9:"青州市";i:370782;s:9:"诸城市";i:370783;s:9:"寿光市";i:370784;s:9:"安丘市";i:370785;s:9:"高密市";i:370786;s:9:"昌邑市";i:370800;s:9:"济宁市";i:370811;s:9:"任城区";i:370812;s:9:"兖州区";i:370826;s:9:"微山县";i:370827;s:9:"鱼台县";i:370828;s:9:"金乡县";i:370829;s:9:"嘉祥县";i:370830;s:9:"汶上县";i:370831;s:9:"泗水县";i:370832;s:9:"梁山县";i:370881;s:9:"曲阜市";i:370883;s:9:"邹城市";i:370900;s:9:"泰安市";i:370902;s:9:"泰山区";i:370911;s:9:"岱岳区";i:370921;s:9:"宁阳县";i:370923;s:9:"东平县";i:370982;s:9:"新泰市";i:370983;s:9:"肥城市";i:371000;s:9:"威海市";i:371002;s:9:"环翠区";i:371003;s:9:"文登区";i:371082;s:9:"荣成市";i:371083;s:9:"乳山市";i:371100;s:9:"日照市";i:371102;s:9:"东港区";i:371103;s:9:"岚山区";i:371121;s:9:"五莲县";i:371122;s:6:"莒县";i:371300;s:9:"临沂市";i:371302;s:9:"兰山区";i:371311;s:9:"罗庄区";i:371312;s:9:"河东区";i:371321;s:9:"沂南县";i:371322;s:9:"郯城县";i:371323;s:9:"沂水县";i:371324;s:9:"兰陵县";i:371325;s:6:"费县";i:371326;s:9:"平邑县";i:371327;s:9:"莒南县";i:371328;s:9:"蒙阴县";i:371329;s:9:"临沭县";i:371400;s:9:"德州市";i:371402;s:9:"德城区";i:371403;s:9:"陵城区";i:371422;s:9:"宁津县";i:371423;s:9:"庆云县";i:371424;s:9:"临邑县";i:371425;s:9:"齐河县";i:371426;s:9:"平原县";i:371427;s:9:"夏津县";i:371428;s:9:"武城县";i:371481;s:9:"乐陵市";i:371482;s:9:"禹城市";i:371500;s:9:"聊城市";i:371502;s:12:"东昌府区";i:371503;s:9:"茌平区";i:371521;s:9:"阳谷县";i:371522;s:6:"莘县";i:371524;s:9:"东阿县";i:371525;s:6:"冠县";i:371526;s:9:"高唐县";i:371581;s:9:"临清市";i:371600;s:9:"滨州市";i:371602;s:9:"滨城区";i:371603;s:9:"沾化区";i:371621;s:9:"惠民县";i:371622;s:9:"阳信县";i:371623;s:9:"无棣县";i:371625;s:9:"博兴县";i:371681;s:9:"邹平市";i:371700;s:9:"菏泽市";i:371702;s:9:"牡丹区";i:371703;s:9:"定陶区";i:371721;s:6:"曹县";i:371722;s:6:"单县";i:371723;s:9:"成武县";i:371724;s:9:"巨野县";i:371725;s:9:"郓城县";i:371726;s:9:"鄄城县";i:371728;s:9:"东明县";i:410000;s:9:"河南省";i:410100;s:9:"郑州市";i:410102;s:9:"中原区";i:410103;s:9:"二七区";i:410104;s:15:"管城回族区";i:410105;s:9:"金水区";i:410106;s:9:"上街区";i:410108;s:9:"惠济区";i:410122;s:9:"中牟县";i:410181;s:9:"巩义市";i:410182;s:9:"荥阳市";i:410183;s:9:"新密市";i:410184;s:9:"新郑市";i:410185;s:9:"登封市";i:410200;s:9:"开封市";i:410202;s:9:"龙亭区";i:410203;s:15:"顺河回族区";i:410204;s:9:"鼓楼区";i:410205;s:12:"禹王台区";i:410212;s:9:"祥符区";i:410221;s:6:"杞县";i:410222;s:9:"通许县";i:410223;s:9:"尉氏县";i:410225;s:9:"兰考县";i:410300;s:9:"洛阳市";i:410302;s:9:"老城区";i:410303;s:9:"西工区";i:410304;s:15:"瀍河回族区";i:410305;s:9:"涧西区";i:410306;s:9:"吉利区";i:410311;s:9:"洛龙区";i:410322;s:9:"孟津县";i:410323;s:9:"新安县";i:410324;s:9:"栾川县";i:410325;s:6:"嵩县";i:410326;s:9:"汝阳县";i:410327;s:9:"宜阳县";i:410328;s:9:"洛宁县";i:410329;s:9:"伊川县";i:410381;s:9:"偃师市";i:410400;s:12:"平顶山市";i:410402;s:9:"新华区";i:410403;s:9:"卫东区";i:410404;s:9:"石龙区";i:410411;s:9:"湛河区";i:410421;s:9:"宝丰县";i:410422;s:6:"叶县";i:410423;s:9:"鲁山县";i:410425;s:6:"郏县";i:410481;s:9:"舞钢市";i:410482;s:9:"汝州市";i:410500;s:9:"安阳市";i:410502;s:9:"文峰区";i:410503;s:9:"北关区";i:410505;s:9:"殷都区";i:410506;s:9:"龙安区";i:410522;s:9:"安阳县";i:410523;s:9:"汤阴县";i:410526;s:6:"滑县";i:410527;s:9:"内黄县";i:410581;s:9:"林州市";i:410600;s:9:"鹤壁市";i:410602;s:9:"鹤山区";i:410603;s:9:"山城区";i:410611;s:9:"淇滨区";i:410621;s:6:"浚县";i:410622;s:6:"淇县";i:410700;s:9:"新乡市";i:410702;s:9:"红旗区";i:410703;s:9:"卫滨区";i:410704;s:9:"凤泉区";i:410711;s:9:"牧野区";i:410721;s:9:"新乡县";i:410724;s:9:"获嘉县";i:410725;s:9:"原阳县";i:410726;s:9:"延津县";i:410727;s:9:"封丘县";i:410781;s:9:"卫辉市";i:410782;s:9:"辉县市";i:410783;s:9:"长垣市";i:410800;s:9:"焦作市";i:410802;s:9:"解放区";i:410803;s:9:"中站区";i:410804;s:9:"马村区";i:410811;s:9:"山阳区";i:410821;s:9:"修武县";i:410822;s:9:"博爱县";i:410823;s:9:"武陟县";i:410825;s:6:"温县";i:410882;s:9:"沁阳市";i:410883;s:9:"孟州市";i:410900;s:9:"濮阳市";i:410902;s:9:"华龙区";i:410922;s:9:"清丰县";i:410923;s:9:"南乐县";i:410926;s:6:"范县";i:410927;s:9:"台前县";i:410928;s:9:"濮阳县";i:411000;s:9:"许昌市";i:411002;s:9:"魏都区";i:411003;s:9:"建安区";i:411024;s:9:"鄢陵县";i:411025;s:9:"襄城县";i:411081;s:9:"禹州市";i:411082;s:9:"长葛市";i:411100;s:9:"漯河市";i:411102;s:9:"源汇区";i:411103;s:9:"郾城区";i:411104;s:9:"召陵区";i:411121;s:9:"舞阳县";i:411122;s:9:"临颍县";i:411200;s:12:"三门峡市";i:411202;s:9:"湖滨区";i:411203;s:9:"陕州区";i:411221;s:9:"渑池县";i:411224;s:9:"卢氏县";i:411281;s:9:"义马市";i:411282;s:9:"灵宝市";i:411300;s:9:"南阳市";i:411302;s:9:"宛城区";i:411303;s:9:"卧龙区";i:411321;s:9:"南召县";i:411322;s:9:"方城县";i:411323;s:9:"西峡县";i:411324;s:9:"镇平县";i:411325;s:9:"内乡县";i:411326;s:9:"淅川县";i:411327;s:9:"社旗县";i:411328;s:9:"唐河县";i:411329;s:9:"新野县";i:411330;s:9:"桐柏县";i:411381;s:9:"邓州市";i:411400;s:9:"商丘市";i:411402;s:9:"梁园区";i:411403;s:9:"睢阳区";i:411421;s:9:"民权县";i:411422;s:6:"睢县";i:411423;s:9:"宁陵县";i:411424;s:9:"柘城县";i:411425;s:9:"虞城县";i:411426;s:9:"夏邑县";i:411481;s:9:"永城市";i:411500;s:9:"信阳市";i:411502;s:9:"浉河区";i:411503;s:9:"平桥区";i:411521;s:9:"罗山县";i:411522;s:9:"光山县";i:411523;s:6:"新县";i:411524;s:9:"商城县";i:411525;s:9:"固始县";i:411526;s:9:"潢川县";i:411527;s:9:"淮滨县";i:411528;s:6:"息县";i:411600;s:9:"周口市";i:411602;s:9:"川汇区";i:411603;s:9:"淮阳区";i:411621;s:9:"扶沟县";i:411622;s:9:"西华县";i:411623;s:9:"商水县";i:411624;s:9:"沈丘县";i:411625;s:9:"郸城县";i:411627;s:9:"太康县";i:411628;s:9:"鹿邑县";i:411681;s:9:"项城市";i:411700;s:12:"驻马店市";i:411702;s:9:"驿城区";i:411721;s:9:"西平县";i:411722;s:9:"上蔡县";i:411723;s:9:"平舆县";i:411724;s:9:"正阳县";i:411725;s:9:"确山县";i:411726;s:9:"泌阳县";i:411727;s:9:"汝南县";i:411728;s:9:"遂平县";i:411729;s:9:"新蔡县";i:419001;s:9:"济源市";i:420000;s:9:"湖北省";i:420100;s:9:"武汉市";i:420102;s:9:"江岸区";i:420103;s:9:"江汉区";i:420104;s:9:"硚口区";i:420105;s:9:"汉阳区";i:420106;s:9:"武昌区";i:420107;s:9:"青山区";i:420111;s:9:"洪山区";i:420112;s:12:"东西湖区";i:420113;s:9:"汉南区";i:420114;s:9:"蔡甸区";i:420115;s:9:"江夏区";i:420116;s:9:"黄陂区";i:420117;s:9:"新洲区";i:420200;s:9:"黄石市";i:420202;s:12:"黄石港区";i:420203;s:12:"西塞山区";i:420204;s:9:"下陆区";i:420205;s:9:"铁山区";i:420222;s:9:"阳新县";i:420281;s:9:"大冶市";i:420300;s:9:"十堰市";i:420302;s:9:"茅箭区";i:420303;s:9:"张湾区";i:420304;s:9:"郧阳区";i:420322;s:9:"郧西县";i:420323;s:9:"竹山县";i:420324;s:9:"竹溪县";i:420325;s:6:"房县";i:420381;s:12:"丹江口市";i:420500;s:9:"宜昌市";i:420502;s:9:"西陵区";i:420503;s:12:"伍家岗区";i:420504;s:9:"点军区";i:420505;s:9:"猇亭区";i:420506;s:9:"夷陵区";i:420525;s:9:"远安县";i:420526;s:9:"兴山县";i:420527;s:9:"秭归县";i:420528;s:24:"长阳土家族自治县";i:420529;s:24:"五峰土家族自治县";i:420581;s:9:"宜都市";i:420582;s:9:"当阳市";i:420583;s:9:"枝江市";i:420600;s:9:"襄阳市";i:420602;s:9:"襄城区";i:420606;s:9:"樊城区";i:420607;s:9:"襄州区";i:420624;s:9:"南漳县";i:420625;s:9:"谷城县";i:420626;s:9:"保康县";i:420682;s:12:"老河口市";i:420683;s:9:"枣阳市";i:420684;s:9:"宜城市";i:420700;s:9:"鄂州市";i:420702;s:12:"梁子湖区";i:420703;s:9:"华容区";i:420704;s:9:"鄂城区";i:420800;s:9:"荆门市";i:420802;s:9:"东宝区";i:420804;s:9:"掇刀区";i:420822;s:9:"沙洋县";i:420881;s:9:"钟祥市";i:420882;s:9:"京山市";i:420900;s:9:"孝感市";i:420902;s:9:"孝南区";i:420921;s:9:"孝昌县";i:420922;s:9:"大悟县";i:420923;s:9:"云梦县";i:420981;s:9:"应城市";i:420982;s:9:"安陆市";i:420984;s:9:"汉川市";i:421000;s:9:"荆州市";i:421002;s:9:"沙市区";i:421003;s:9:"荆州区";i:421022;s:9:"公安县";i:421024;s:9:"江陵县";i:421081;s:9:"石首市";i:421083;s:9:"洪湖市";i:421087;s:9:"松滋市";i:421088;s:9:"监利市";i:421100;s:9:"黄冈市";i:421102;s:9:"黄州区";i:421121;s:9:"团风县";i:421122;s:9:"红安县";i:421123;s:9:"罗田县";i:421124;s:9:"英山县";i:421125;s:9:"浠水县";i:421126;s:9:"蕲春县";i:421127;s:9:"黄梅县";i:421181;s:9:"麻城市";i:421182;s:9:"武穴市";i:421200;s:9:"咸宁市";i:421202;s:9:"咸安区";i:421221;s:9:"嘉鱼县";i:421222;s:9:"通城县";i:421223;s:9:"崇阳县";i:421224;s:9:"通山县";i:421281;s:9:"赤壁市";i:421300;s:9:"随州市";i:421303;s:9:"曾都区";i:421321;s:6:"随县";i:421381;s:9:"广水市";i:422800;s:30:"恩施土家族苗族自治州";i:422801;s:9:"恩施市";i:422802;s:9:"利川市";i:422822;s:9:"建始县";i:422823;s:9:"巴东县";i:422825;s:9:"宣恩县";i:422826;s:9:"咸丰县";i:422827;s:9:"来凤县";i:422828;s:9:"鹤峰县";i:429004;s:9:"仙桃市";i:429005;s:9:"潜江市";i:429006;s:9:"天门市";i:429021;s:15:"神农架林区";i:430000;s:9:"湖南省";i:430100;s:9:"长沙市";i:430102;s:9:"芙蓉区";i:430103;s:9:"天心区";i:430104;s:9:"岳麓区";i:430105;s:9:"开福区";i:430111;s:9:"雨花区";i:430112;s:9:"望城区";i:430121;s:9:"长沙县";i:430181;s:9:"浏阳市";i:430182;s:9:"宁乡市";i:430200;s:9:"株洲市";i:430202;s:9:"荷塘区";i:430203;s:9:"芦淞区";i:430204;s:9:"石峰区";i:430211;s:9:"天元区";i:430212;s:9:"渌口区";i:430223;s:6:"攸县";i:430224;s:9:"茶陵县";i:430225;s:9:"炎陵县";i:430281;s:9:"醴陵市";i:430300;s:9:"湘潭市";i:430302;s:9:"雨湖区";i:430304;s:9:"岳塘区";i:430321;s:9:"湘潭县";i:430381;s:9:"湘乡市";i:430382;s:9:"韶山市";i:430400;s:9:"衡阳市";i:430405;s:9:"珠晖区";i:430406;s:9:"雁峰区";i:430407;s:9:"石鼓区";i:430408;s:9:"蒸湘区";i:430412;s:9:"南岳区";i:430421;s:9:"衡阳县";i:430422;s:9:"衡南县";i:430423;s:9:"衡山县";i:430424;s:9:"衡东县";i:430426;s:9:"祁东县";i:430481;s:9:"耒阳市";i:430482;s:9:"常宁市";i:430500;s:9:"邵阳市";i:430502;s:9:"双清区";i:430503;s:9:"大祥区";i:430511;s:9:"北塔区";i:430522;s:9:"新邵县";i:430523;s:9:"邵阳县";i:430524;s:9:"隆回县";i:430525;s:9:"洞口县";i:430527;s:9:"绥宁县";i:430528;s:9:"新宁县";i:430529;s:21:"城步苗族自治县";i:430581;s:9:"武冈市";i:430582;s:9:"邵东市";i:430600;s:9:"岳阳市";i:430602;s:12:"岳阳楼区";i:430603;s:9:"云溪区";i:430611;s:9:"君山区";i:430621;s:9:"岳阳县";i:430623;s:9:"华容县";i:430624;s:9:"湘阴县";i:430626;s:9:"平江县";i:430681;s:9:"汨罗市";i:430682;s:9:"临湘市";i:430700;s:9:"常德市";i:430702;s:9:"武陵区";i:430703;s:9:"鼎城区";i:430721;s:9:"安乡县";i:430722;s:9:"汉寿县";i:430723;s:6:"澧县";i:430724;s:9:"临澧县";i:430725;s:9:"桃源县";i:430726;s:9:"石门县";i:430781;s:9:"津市市";i:430800;s:12:"张家界市";i:430802;s:9:"永定区";i:430811;s:12:"武陵源区";i:430821;s:9:"慈利县";i:430822;s:9:"桑植县";i:430900;s:9:"益阳市";i:430902;s:9:"资阳区";i:430903;s:9:"赫山区";i:430921;s:6:"南县";i:430922;s:9:"桃江县";i:430923;s:9:"安化县";i:430981;s:9:"沅江市";i:431000;s:9:"郴州市";i:431002;s:9:"北湖区";i:431003;s:9:"苏仙区";i:431021;s:9:"桂阳县";i:431022;s:9:"宜章县";i:431023;s:9:"永兴县";i:431024;s:9:"嘉禾县";i:431025;s:9:"临武县";i:431026;s:9:"汝城县";i:431027;s:9:"桂东县";i:431028;s:9:"安仁县";i:431081;s:9:"资兴市";i:431100;s:9:"永州市";i:431102;s:9:"零陵区";i:431103;s:12:"冷水滩区";i:431121;s:9:"祁阳县";i:431122;s:9:"东安县";i:431123;s:9:"双牌县";i:431124;s:6:"道县";i:431125;s:9:"江永县";i:431126;s:9:"宁远县";i:431127;s:9:"蓝山县";i:431128;s:9:"新田县";i:431129;s:21:"江华瑶族自治县";i:431200;s:9:"怀化市";i:431202;s:9:"鹤城区";i:431221;s:9:"中方县";i:431222;s:9:"沅陵县";i:431223;s:9:"辰溪县";i:431224;s:9:"溆浦县";i:431225;s:9:"会同县";i:431226;s:21:"麻阳苗族自治县";i:431227;s:21:"新晃侗族自治县";i:431228;s:21:"芷江侗族自治县";i:431229;s:27:"靖州苗族侗族自治县";i:431230;s:21:"通道侗族自治县";i:431281;s:9:"洪江市";i:431300;s:9:"娄底市";i:431302;s:9:"娄星区";i:431321;s:9:"双峰县";i:431322;s:9:"新化县";i:431381;s:12:"冷水江市";i:431382;s:9:"涟源市";i:433100;s:30:"湘西土家族苗族自治州";i:433101;s:9:"吉首市";i:433122;s:9:"泸溪县";i:433123;s:9:"凤凰县";i:433124;s:9:"花垣县";i:433125;s:9:"保靖县";i:433126;s:9:"古丈县";i:433127;s:9:"永顺县";i:433130;s:9:"龙山县";i:440000;s:9:"广东省";i:440100;s:9:"广州市";i:440103;s:9:"荔湾区";i:440104;s:9:"越秀区";i:440105;s:9:"海珠区";i:440106;s:9:"天河区";i:440111;s:9:"白云区";i:440112;s:9:"黄埔区";i:440113;s:9:"番禺区";i:440114;s:9:"花都区";i:440115;s:9:"南沙区";i:440117;s:9:"从化区";i:440118;s:9:"增城区";i:440200;s:9:"韶关市";i:440203;s:9:"武江区";i:440204;s:9:"浈江区";i:440205;s:9:"曲江区";i:440222;s:9:"始兴县";i:440224;s:9:"仁化县";i:440229;s:9:"翁源县";i:440232;s:21:"乳源瑶族自治县";i:440233;s:9:"新丰县";i:440281;s:9:"乐昌市";i:440282;s:9:"南雄市";i:440300;s:9:"深圳市";i:440303;s:9:"罗湖区";i:440304;s:9:"福田区";i:440305;s:9:"南山区";i:440306;s:9:"宝安区";i:440307;s:9:"龙岗区";i:440308;s:9:"盐田区";i:440309;s:9:"龙华区";i:440310;s:9:"坪山区";i:440311;s:9:"光明区";i:440400;s:9:"珠海市";i:440402;s:9:"香洲区";i:440403;s:9:"斗门区";i:440404;s:9:"金湾区";i:440500;s:9:"汕头市";i:440507;s:9:"龙湖区";i:440511;s:9:"金平区";i:440512;s:9:"濠江区";i:440513;s:9:"潮阳区";i:440514;s:9:"潮南区";i:440515;s:9:"澄海区";i:440523;s:9:"南澳县";i:440600;s:9:"佛山市";i:440604;s:9:"禅城区";i:440605;s:9:"南海区";i:440606;s:9:"顺德区";i:440607;s:9:"三水区";i:440608;s:9:"高明区";i:440700;s:9:"江门市";i:440703;s:9:"蓬江区";i:440704;s:9:"江海区";i:440705;s:9:"新会区";i:440781;s:9:"台山市";i:440783;s:9:"开平市";i:440784;s:9:"鹤山市";i:440785;s:9:"恩平市";i:440800;s:9:"湛江市";i:440802;s:9:"赤坎区";i:440803;s:9:"霞山区";i:440804;s:9:"坡头区";i:440811;s:9:"麻章区";i:440823;s:9:"遂溪县";i:440825;s:9:"徐闻县";i:440881;s:9:"廉江市";i:440882;s:9:"雷州市";i:440883;s:9:"吴川市";i:440900;s:9:"茂名市";i:440902;s:9:"茂南区";i:440904;s:9:"电白区";i:440981;s:9:"高州市";i:440982;s:9:"化州市";i:440983;s:9:"信宜市";i:441200;s:9:"肇庆市";i:441202;s:9:"端州区";i:441203;s:9:"鼎湖区";i:441204;s:9:"高要区";i:441223;s:9:"广宁县";i:441224;s:9:"怀集县";i:441225;s:9:"封开县";i:441226;s:9:"德庆县";i:441284;s:9:"四会市";i:441300;s:9:"惠州市";i:441302;s:9:"惠城区";i:441303;s:9:"惠阳区";i:441322;s:9:"博罗县";i:441323;s:9:"惠东县";i:441324;s:9:"龙门县";i:441400;s:9:"梅州市";i:441402;s:9:"梅江区";i:441403;s:9:"梅县区";i:441422;s:9:"大埔县";i:441423;s:9:"丰顺县";i:441424;s:9:"五华县";i:441426;s:9:"平远县";i:441427;s:9:"蕉岭县";i:441481;s:9:"兴宁市";i:441500;s:9:"汕尾市";i:441502;s:6:"城区";i:441521;s:9:"海丰县";i:441523;s:9:"陆河县";i:441581;s:9:"陆丰市";i:441600;s:9:"河源市";i:441602;s:9:"源城区";i:441621;s:9:"紫金县";i:441622;s:9:"龙川县";i:441623;s:9:"连平县";i:441624;s:9:"和平县";i:441625;s:9:"东源县";i:441700;s:9:"阳江市";i:441702;s:9:"江城区";i:441704;s:9:"阳东区";i:441721;s:9:"阳西县";i:441781;s:9:"阳春市";i:441800;s:9:"清远市";i:441802;s:9:"清城区";i:441803;s:9:"清新区";i:441821;s:9:"佛冈县";i:441823;s:9:"阳山县";i:441825;s:27:"连山壮族瑶族自治县";i:441826;s:21:"连南瑶族自治县";i:441881;s:9:"英德市";i:441882;s:9:"连州市";i:441900;s:9:"东莞市";i:442000;s:9:"中山市";i:445100;s:9:"潮州市";i:445102;s:9:"湘桥区";i:445103;s:9:"潮安区";i:445122;s:9:"饶平县";i:445200;s:9:"揭阳市";i:445202;s:9:"榕城区";i:445203;s:9:"揭东区";i:445222;s:9:"揭西县";i:445224;s:9:"惠来县";i:445281;s:9:"普宁市";i:445300;s:9:"云浮市";i:445302;s:9:"云城区";i:445303;s:9:"云安区";i:445321;s:9:"新兴县";i:445322;s:9:"郁南县";i:445381;s:9:"罗定市";i:450000;s:21:"广西壮族自治区";i:450100;s:9:"南宁市";i:450102;s:9:"兴宁区";i:450103;s:9:"青秀区";i:450105;s:9:"江南区";i:450107;s:12:"西乡塘区";i:450108;s:9:"良庆区";i:450109;s:9:"邕宁区";i:450110;s:9:"武鸣区";i:450123;s:9:"隆安县";i:450124;s:9:"马山县";i:450125;s:9:"上林县";i:450126;s:9:"宾阳县";i:450127;s:6:"横县";i:450200;s:9:"柳州市";i:450202;s:9:"城中区";i:450203;s:9:"鱼峰区";i:450204;s:9:"柳南区";i:450205;s:9:"柳北区";i:450206;s:9:"柳江区";i:450222;s:9:"柳城县";i:450223;s:9:"鹿寨县";i:450224;s:9:"融安县";i:450225;s:21:"融水苗族自治县";i:450226;s:21:"三江侗族自治县";i:450300;s:9:"桂林市";i:450302;s:9:"秀峰区";i:450303;s:9:"叠彩区";i:450304;s:9:"象山区";i:450305;s:9:"七星区";i:450311;s:9:"雁山区";i:450312;s:9:"临桂区";i:450321;s:9:"阳朔县";i:450323;s:9:"灵川县";i:450324;s:9:"全州县";i:450325;s:9:"兴安县";i:450326;s:9:"永福县";i:450327;s:9:"灌阳县";i:450328;s:21:"龙胜各族自治县";i:450329;s:9:"资源县";i:450330;s:9:"平乐县";i:450332;s:21:"恭城瑶族自治县";i:450381;s:9:"荔浦市";i:450400;s:9:"梧州市";i:450403;s:9:"万秀区";i:450405;s:9:"长洲区";i:450406;s:9:"龙圩区";i:450421;s:9:"苍梧县";i:450422;s:6:"藤县";i:450423;s:9:"蒙山县";i:450481;s:9:"岑溪市";i:450500;s:9:"北海市";i:450502;s:9:"海城区";i:450503;s:9:"银海区";i:450512;s:12:"铁山港区";i:450521;s:9:"合浦县";i:450600;s:12:"防城港市";i:450602;s:9:"港口区";i:450603;s:9:"防城区";i:450621;s:9:"上思县";i:450681;s:9:"东兴市";i:450700;s:9:"钦州市";i:450702;s:9:"钦南区";i:450703;s:9:"钦北区";i:450721;s:9:"灵山县";i:450722;s:9:"浦北县";i:450800;s:9:"贵港市";i:450802;s:9:"港北区";i:450803;s:9:"港南区";i:450804;s:9:"覃塘区";i:450821;s:9:"平南县";i:450881;s:9:"桂平市";i:450900;s:9:"玉林市";i:450902;s:9:"玉州区";i:450903;s:9:"福绵区";i:450921;s:6:"容县";i:450922;s:9:"陆川县";i:450923;s:9:"博白县";i:450924;s:9:"兴业县";i:450981;s:9:"北流市";i:451000;s:9:"百色市";i:451002;s:9:"右江区";i:451003;s:9:"田阳区";i:451022;s:9:"田东县";i:451024;s:9:"德保县";i:451026;s:9:"那坡县";i:451027;s:9:"凌云县";i:451028;s:9:"乐业县";i:451029;s:9:"田林县";i:451030;s:9:"西林县";i:451031;s:21:"隆林各族自治县";i:451081;s:9:"靖西市";i:451082;s:9:"平果市";i:451100;s:9:"贺州市";i:451102;s:9:"八步区";i:451103;s:9:"平桂区";i:451121;s:9:"昭平县";i:451122;s:9:"钟山县";i:451123;s:21:"富川瑶族自治县";i:451200;s:9:"河池市";i:451202;s:12:"金城江区";i:451203;s:9:"宜州区";i:451221;s:9:"南丹县";i:451222;s:9:"天峨县";i:451223;s:9:"凤山县";i:451224;s:9:"东兰县";i:451225;s:24:"罗城仫佬族自治县";i:451226;s:24:"环江毛南族自治县";i:451227;s:21:"巴马瑶族自治县";i:451228;s:21:"都安瑶族自治县";i:451229;s:21:"大化瑶族自治县";i:451300;s:9:"来宾市";i:451302;s:9:"兴宾区";i:451321;s:9:"忻城县";i:451322;s:9:"象州县";i:451323;s:9:"武宣县";i:451324;s:21:"金秀瑶族自治县";i:451381;s:9:"合山市";i:451400;s:9:"崇左市";i:451402;s:9:"江州区";i:451421;s:9:"扶绥县";i:451422;s:9:"宁明县";i:451423;s:9:"龙州县";i:451424;s:9:"大新县";i:451425;s:9:"天等县";i:451481;s:9:"凭祥市";i:460000;s:9:"海南省";i:460100;s:9:"海口市";i:460105;s:9:"秀英区";i:460106;s:9:"龙华区";i:460107;s:9:"琼山区";i:460108;s:9:"美兰区";i:460200;s:9:"三亚市";i:460202;s:9:"海棠区";i:460203;s:9:"吉阳区";i:460204;s:9:"天涯区";i:460205;s:9:"崖州区";i:460300;s:9:"三沙市";i:460400;s:9:"儋州市";i:469001;s:12:"五指山市";i:469002;s:9:"琼海市";i:469005;s:9:"文昌市";i:469006;s:9:"万宁市";i:469007;s:9:"东方市";i:469021;s:9:"定安县";i:469022;s:9:"屯昌县";i:469023;s:9:"澄迈县";i:469024;s:9:"临高县";i:469025;s:21:"白沙黎族自治县";i:469026;s:21:"昌江黎族自治县";i:469027;s:21:"乐东黎族自治县";i:469028;s:21:"陵水黎族自治县";i:469029;s:27:"保亭黎族苗族自治县";i:469030;s:27:"琼中黎族苗族自治县";i:500000;s:9:"重庆市";i:500101;s:9:"万州区";i:500102;s:9:"涪陵区";i:500103;s:9:"渝中区";i:500104;s:12:"大渡口区";i:500105;s:9:"江北区";i:500106;s:12:"沙坪坝区";i:500107;s:12:"九龙坡区";i:500108;s:9:"南岸区";i:500109;s:9:"北碚区";i:500110;s:9:"綦江区";i:500111;s:9:"大足区";i:500112;s:9:"渝北区";i:500113;s:9:"巴南区";i:500114;s:9:"黔江区";i:500115;s:9:"长寿区";i:500116;s:9:"江津区";i:500117;s:9:"合川区";i:500118;s:9:"永川区";i:500119;s:9:"南川区";i:500120;s:9:"璧山区";i:500151;s:9:"铜梁区";i:500152;s:9:"潼南区";i:500153;s:9:"荣昌区";i:500154;s:9:"开州区";i:500155;s:9:"梁平区";i:500156;s:9:"武隆区";i:500229;s:9:"城口县";i:500230;s:9:"丰都县";i:500231;s:9:"垫江县";i:500233;s:6:"忠县";i:500235;s:9:"云阳县";i:500236;s:9:"奉节县";i:500237;s:9:"巫山县";i:500238;s:9:"巫溪县";i:500240;s:24:"石柱土家族自治县";i:500241;s:30:"秀山土家族苗族自治县";i:500242;s:30:"酉阳土家族苗族自治县";i:500243;s:30:"彭水苗族土家族自治县";i:510000;s:9:"四川省";i:510100;s:9:"成都市";i:510104;s:9:"锦江区";i:510105;s:9:"青羊区";i:510106;s:9:"金牛区";i:510107;s:9:"武侯区";i:510108;s:9:"成华区";i:510112;s:12:"龙泉驿区";i:510113;s:12:"青白江区";i:510114;s:9:"新都区";i:510115;s:9:"温江区";i:510116;s:9:"双流区";i:510117;s:9:"郫都区";i:510118;s:9:"新津区";i:510121;s:9:"金堂县";i:510129;s:9:"大邑县";i:510131;s:9:"蒲江县";i:510181;s:12:"都江堰市";i:510182;s:9:"彭州市";i:510183;s:9:"邛崃市";i:510184;s:9:"崇州市";i:510185;s:9:"简阳市";i:510300;s:9:"自贡市";i:510302;s:12:"自流井区";i:510303;s:9:"贡井区";i:510304;s:9:"大安区";i:510311;s:9:"沿滩区";i:510321;s:6:"荣县";i:510322;s:9:"富顺县";i:510400;s:12:"攀枝花市";i:510402;s:6:"东区";i:510403;s:6:"西区";i:510411;s:9:"仁和区";i:510421;s:9:"米易县";i:510422;s:9:"盐边县";i:510500;s:9:"泸州市";i:510502;s:9:"江阳区";i:510503;s:9:"纳溪区";i:510504;s:12:"龙马潭区";i:510521;s:6:"泸县";i:510522;s:9:"合江县";i:510524;s:9:"叙永县";i:510525;s:9:"古蔺县";i:510600;s:9:"德阳市";i:510603;s:9:"旌阳区";i:510604;s:9:"罗江区";i:510623;s:9:"中江县";i:510681;s:9:"广汉市";i:510682;s:9:"什邡市";i:510683;s:9:"绵竹市";i:510700;s:9:"绵阳市";i:510703;s:9:"涪城区";i:510704;s:9:"游仙区";i:510705;s:9:"安州区";i:510722;s:9:"三台县";i:510723;s:9:"盐亭县";i:510725;s:9:"梓潼县";i:510726;s:21:"北川羌族自治县";i:510727;s:9:"平武县";i:510781;s:9:"江油市";i:510800;s:9:"广元市";i:510802;s:9:"利州区";i:510811;s:9:"昭化区";i:510812;s:9:"朝天区";i:510821;s:9:"旺苍县";i:510822;s:9:"青川县";i:510823;s:9:"剑阁县";i:510824;s:9:"苍溪县";i:510900;s:9:"遂宁市";i:510903;s:9:"船山区";i:510904;s:9:"安居区";i:510921;s:9:"蓬溪县";i:510923;s:9:"大英县";i:510981;s:9:"射洪市";i:511000;s:9:"内江市";i:511002;s:9:"市中区";i:511011;s:9:"东兴区";i:511024;s:9:"威远县";i:511025;s:9:"资中县";i:511083;s:9:"隆昌市";i:511100;s:9:"乐山市";i:511102;s:9:"市中区";i:511111;s:9:"沙湾区";i:511112;s:12:"五通桥区";i:511113;s:12:"金口河区";i:511123;s:9:"犍为县";i:511124;s:9:"井研县";i:511126;s:9:"夹江县";i:511129;s:9:"沐川县";i:511132;s:21:"峨边彝族自治县";i:511133;s:21:"马边彝族自治县";i:511181;s:12:"峨眉山市";i:511300;s:9:"南充市";i:511302;s:9:"顺庆区";i:511303;s:9:"高坪区";i:511304;s:9:"嘉陵区";i:511321;s:9:"南部县";i:511322;s:9:"营山县";i:511323;s:9:"蓬安县";i:511324;s:9:"仪陇县";i:511325;s:9:"西充县";i:511381;s:9:"阆中市";i:511400;s:9:"眉山市";i:511402;s:9:"东坡区";i:511403;s:9:"彭山区";i:511421;s:9:"仁寿县";i:511423;s:9:"洪雅县";i:511424;s:9:"丹棱县";i:511425;s:9:"青神县";i:511500;s:9:"宜宾市";i:511502;s:9:"翠屏区";i:511503;s:9:"南溪区";i:511504;s:9:"叙州区";i:511523;s:9:"江安县";i:511524;s:9:"长宁县";i:511525;s:6:"高县";i:511526;s:6:"珙县";i:511527;s:9:"筠连县";i:511528;s:9:"兴文县";i:511529;s:9:"屏山县";i:511600;s:9:"广安市";i:511602;s:9:"广安区";i:511603;s:9:"前锋区";i:511621;s:9:"岳池县";i:511622;s:9:"武胜县";i:511623;s:9:"邻水县";i:511681;s:9:"华蓥市";i:511700;s:9:"达州市";i:511702;s:9:"通川区";i:511703;s:9:"达川区";i:511722;s:9:"宣汉县";i:511723;s:9:"开江县";i:511724;s:9:"大竹县";i:511725;s:6:"渠县";i:511781;s:9:"万源市";i:511800;s:9:"雅安市";i:511802;s:9:"雨城区";i:511803;s:9:"名山区";i:511822;s:9:"荥经县";i:511823;s:9:"汉源县";i:511824;s:9:"石棉县";i:511825;s:9:"天全县";i:511826;s:9:"芦山县";i:511827;s:9:"宝兴县";i:511900;s:9:"巴中市";i:511902;s:9:"巴州区";i:511903;s:9:"恩阳区";i:511921;s:9:"通江县";i:511922;s:9:"南江县";i:511923;s:9:"平昌县";i:512000;s:9:"资阳市";i:512002;s:9:"雁江区";i:512021;s:9:"安岳县";i:512022;s:9:"乐至县";i:513200;s:27:"阿坝藏族羌族自治州";i:513201;s:12:"马尔康市";i:513221;s:9:"汶川县";i:513222;s:6:"理县";i:513223;s:6:"茂县";i:513224;s:9:"松潘县";i:513225;s:12:"九寨沟县";i:513226;s:9:"金川县";i:513227;s:9:"小金县";i:513228;s:9:"黑水县";i:513230;s:9:"壤塘县";i:513231;s:9:"阿坝县";i:513232;s:12:"若尔盖县";i:513233;s:9:"红原县";i:513300;s:21:"甘孜藏族自治州";i:513301;s:9:"康定市";i:513322;s:9:"泸定县";i:513323;s:9:"丹巴县";i:513324;s:9:"九龙县";i:513325;s:9:"雅江县";i:513326;s:9:"道孚县";i:513327;s:9:"炉霍县";i:513328;s:9:"甘孜县";i:513329;s:9:"新龙县";i:513330;s:9:"德格县";i:513331;s:9:"白玉县";i:513332;s:9:"石渠县";i:513333;s:9:"色达县";i:513334;s:9:"理塘县";i:513335;s:9:"巴塘县";i:513336;s:9:"乡城县";i:513337;s:9:"稻城县";i:513338;s:9:"得荣县";i:513400;s:21:"凉山彝族自治州";i:513401;s:9:"西昌市";i:513422;s:21:"木里藏族自治县";i:513423;s:9:"盐源县";i:513424;s:9:"德昌县";i:513425;s:9:"会理县";i:513426;s:9:"会东县";i:513427;s:9:"宁南县";i:513428;s:9:"普格县";i:513429;s:9:"布拖县";i:513430;s:9:"金阳县";i:513431;s:9:"昭觉县";i:513432;s:9:"喜德县";i:513433;s:9:"冕宁县";i:513434;s:9:"越西县";i:513435;s:9:"甘洛县";i:513436;s:9:"美姑县";i:513437;s:9:"雷波县";i:520000;s:9:"贵州省";i:520100;s:9:"贵阳市";i:520102;s:9:"南明区";i:520103;s:9:"云岩区";i:520111;s:9:"花溪区";i:520112;s:9:"乌当区";i:520113;s:9:"白云区";i:520115;s:12:"观山湖区";i:520121;s:9:"开阳县";i:520122;s:9:"息烽县";i:520123;s:9:"修文县";i:520181;s:9:"清镇市";i:520200;s:12:"六盘水市";i:520201;s:9:"钟山区";i:520203;s:12:"六枝特区";i:520204;s:9:"水城区";i:520281;s:9:"盘州市";i:520300;s:9:"遵义市";i:520302;s:12:"红花岗区";i:520303;s:9:"汇川区";i:520304;s:9:"播州区";i:520322;s:9:"桐梓县";i:520323;s:9:"绥阳县";i:520324;s:9:"正安县";i:520325;s:30:"道真仡佬族苗族自治县";i:520326;s:30:"务川仡佬族苗族自治县";i:520327;s:9:"凤冈县";i:520328;s:9:"湄潭县";i:520329;s:9:"余庆县";i:520330;s:9:"习水县";i:520381;s:9:"赤水市";i:520382;s:9:"仁怀市";i:520400;s:9:"安顺市";i:520402;s:9:"西秀区";i:520403;s:9:"平坝区";i:520422;s:9:"普定县";i:520423;s:30:"镇宁布依族苗族自治县";i:520424;s:30:"关岭布依族苗族自治县";i:520425;s:30:"紫云苗族布依族自治县";i:520500;s:9:"毕节市";i:520502;s:12:"七星关区";i:520521;s:9:"大方县";i:520522;s:9:"黔西县";i:520523;s:9:"金沙县";i:520524;s:9:"织金县";i:520525;s:9:"纳雍县";i:520526;s:33:"威宁彝族回族苗族自治县";i:520527;s:9:"赫章县";i:520600;s:9:"铜仁市";i:520602;s:9:"碧江区";i:520603;s:9:"万山区";i:520621;s:9:"江口县";i:520622;s:21:"玉屏侗族自治县";i:520623;s:9:"石阡县";i:520624;s:9:"思南县";i:520625;s:30:"印江土家族苗族自治县";i:520626;s:9:"德江县";i:520627;s:24:"沿河土家族自治县";i:520628;s:21:"松桃苗族自治县";i:522300;s:33:"黔西南布依族苗族自治州";i:522301;s:9:"兴义市";i:522302;s:9:"兴仁市";i:522323;s:9:"普安县";i:522324;s:9:"晴隆县";i:522325;s:9:"贞丰县";i:522326;s:9:"望谟县";i:522327;s:9:"册亨县";i:522328;s:9:"安龙县";i:522600;s:30:"黔东南苗族侗族自治州";i:522601;s:9:"凯里市";i:522622;s:9:"黄平县";i:522623;s:9:"施秉县";i:522624;s:9:"三穗县";i:522625;s:9:"镇远县";i:522626;s:9:"岑巩县";i:522627;s:9:"天柱县";i:522628;s:9:"锦屏县";i:522629;s:9:"剑河县";i:522630;s:9:"台江县";i:522631;s:9:"黎平县";i:522632;s:9:"榕江县";i:522633;s:9:"从江县";i:522634;s:9:"雷山县";i:522635;s:9:"麻江县";i:522636;s:9:"丹寨县";i:522700;s:30:"黔南布依族苗族自治州";i:522701;s:9:"都匀市";i:522702;s:9:"福泉市";i:522722;s:9:"荔波县";i:522723;s:9:"贵定县";i:522725;s:9:"瓮安县";i:522726;s:9:"独山县";i:522727;s:9:"平塘县";i:522728;s:9:"罗甸县";i:522729;s:9:"长顺县";i:522730;s:9:"龙里县";i:522731;s:9:"惠水县";i:522732;s:21:"三都水族自治县";i:530000;s:9:"云南省";i:530100;s:9:"昆明市";i:530102;s:9:"五华区";i:530103;s:9:"盘龙区";i:530111;s:9:"官渡区";i:530112;s:9:"西山区";i:530113;s:9:"东川区";i:530114;s:9:"呈贡区";i:530115;s:9:"晋宁区";i:530124;s:9:"富民县";i:530125;s:9:"宜良县";i:530126;s:21:"石林彝族自治县";i:530127;s:9:"嵩明县";i:530128;s:27:"禄劝彝族苗族自治县";i:530129;s:27:"寻甸回族彝族自治县";i:530181;s:9:"安宁市";i:530300;s:9:"曲靖市";i:530302;s:9:"麒麟区";i:530303;s:9:"沾益区";i:530304;s:9:"马龙区";i:530322;s:9:"陆良县";i:530323;s:9:"师宗县";i:530324;s:9:"罗平县";i:530325;s:9:"富源县";i:530326;s:9:"会泽县";i:530381;s:9:"宣威市";i:530400;s:9:"玉溪市";i:530402;s:9:"红塔区";i:530403;s:9:"江川区";i:530423;s:9:"通海县";i:530424;s:9:"华宁县";i:530425;s:9:"易门县";i:530426;s:21:"峨山彝族自治县";i:530427;s:27:"新平彝族傣族自治县";i:530428;s:36:"元江哈尼族彝族傣族自治县";i:530481;s:9:"澄江市";i:530500;s:9:"保山市";i:530502;s:9:"隆阳区";i:530521;s:9:"施甸县";i:530523;s:9:"龙陵县";i:530524;s:9:"昌宁县";i:530581;s:9:"腾冲市";i:530600;s:9:"昭通市";i:530602;s:9:"昭阳区";i:530621;s:9:"鲁甸县";i:530622;s:9:"巧家县";i:530623;s:9:"盐津县";i:530624;s:9:"大关县";i:530625;s:9:"永善县";i:530626;s:9:"绥江县";i:530627;s:9:"镇雄县";i:530628;s:9:"彝良县";i:530629;s:9:"威信县";i:530681;s:9:"水富市";i:530700;s:9:"丽江市";i:530702;s:9:"古城区";i:530721;s:24:"玉龙纳西族自治县";i:530722;s:9:"永胜县";i:530723;s:9:"华坪县";i:530724;s:21:"宁蒗彝族自治县";i:530800;s:9:"普洱市";i:530802;s:9:"思茅区";i:530821;s:30:"宁洱哈尼族彝族自治县";i:530822;s:24:"墨江哈尼族自治县";i:530823;s:21:"景东彝族自治县";i:530824;s:27:"景谷傣族彝族自治县";i:530825;s:39:"镇沅彝族哈尼族拉祜族自治县";i:530826;s:30:"江城哈尼族彝族自治县";i:530827;s:36:"孟连傣族拉祜族佤族自治县";i:530828;s:24:"澜沧拉祜族自治县";i:530829;s:21:"西盟佤族自治县";i:530900;s:9:"临沧市";i:530902;s:9:"临翔区";i:530921;s:9:"凤庆县";i:530922;s:6:"云县";i:530923;s:9:"永德县";i:530924;s:9:"镇康县";i:530925;s:45:"双江拉祜族佤族布朗族傣族自治县";i:530926;s:27:"耿马傣族佤族自治县";i:530927;s:21:"沧源佤族自治县";i:532300;s:21:"楚雄彝族自治州";i:532301;s:9:"楚雄市";i:532322;s:9:"双柏县";i:532323;s:9:"牟定县";i:532324;s:9:"南华县";i:532325;s:9:"姚安县";i:532326;s:9:"大姚县";i:532327;s:9:"永仁县";i:532328;s:9:"元谋县";i:532329;s:9:"武定县";i:532331;s:9:"禄丰县";i:532500;s:30:"红河哈尼族彝族自治州";i:532501;s:9:"个旧市";i:532502;s:9:"开远市";i:532503;s:9:"蒙自市";i:532504;s:9:"弥勒市";i:532523;s:21:"屏边苗族自治县";i:532524;s:9:"建水县";i:532525;s:9:"石屏县";i:532527;s:9:"泸西县";i:532528;s:9:"元阳县";i:532529;s:9:"红河县";i:532530;s:33:"金平苗族瑶族傣族自治县";i:532531;s:9:"绿春县";i:532532;s:21:"河口瑶族自治县";i:532600;s:27:"文山壮族苗族自治州";i:532601;s:9:"文山市";i:532622;s:9:"砚山县";i:532623;s:9:"西畴县";i:532624;s:12:"麻栗坡县";i:532625;s:9:"马关县";i:532626;s:9:"丘北县";i:532627;s:9:"广南县";i:532628;s:9:"富宁县";i:532800;s:27:"西双版纳傣族自治州";i:532801;s:9:"景洪市";i:532822;s:9:"勐海县";i:532823;s:9:"勐腊县";i:532900;s:21:"大理白族自治州";i:532901;s:9:"大理市";i:532922;s:21:"漾濞彝族自治县";i:532923;s:9:"祥云县";i:532924;s:9:"宾川县";i:532925;s:9:"弥渡县";i:532926;s:21:"南涧彝族自治县";i:532927;s:27:"巍山彝族回族自治县";i:532928;s:9:"永平县";i:532929;s:9:"云龙县";i:532930;s:9:"洱源县";i:532931;s:9:"剑川县";i:532932;s:9:"鹤庆县";i:533100;s:30:"德宏傣族景颇族自治州";i:533102;s:9:"瑞丽市";i:533103;s:6:"芒市";i:533122;s:9:"梁河县";i:533123;s:9:"盈江县";i:533124;s:9:"陇川县";i:533300;s:24:"怒江傈僳族自治州";i:533301;s:9:"泸水市";i:533323;s:9:"福贡县";i:533324;s:30:"贡山独龙族怒族自治县";i:533325;s:30:"兰坪白族普米族自治县";i:533400;s:21:"迪庆藏族自治州";i:533401;s:15:"香格里拉市";i:533422;s:9:"德钦县";i:533423;s:24:"维西傈僳族自治县";i:540000;s:15:"西藏自治区";i:540100;s:9:"拉萨市";i:540102;s:9:"城关区";i:540103;s:15:"堆龙德庆区";i:540104;s:9:"达孜区";i:540121;s:9:"林周县";i:540122;s:9:"当雄县";i:540123;s:9:"尼木县";i:540124;s:9:"曲水县";i:540127;s:15:"墨竹工卡县";i:540200;s:12:"日喀则市";i:540202;s:12:"桑珠孜区";i:540221;s:12:"南木林县";i:540222;s:9:"江孜县";i:540223;s:9:"定日县";i:540224;s:9:"萨迦县";i:540225;s:9:"拉孜县";i:540226;s:9:"昂仁县";i:540227;s:12:"谢通门县";i:540228;s:9:"白朗县";i:540229;s:9:"仁布县";i:540230;s:9:"康马县";i:540231;s:9:"定结县";i:540232;s:9:"仲巴县";i:540233;s:9:"亚东县";i:540234;s:9:"吉隆县";i:540235;s:12:"聂拉木县";i:540236;s:9:"萨嘎县";i:540237;s:9:"岗巴县";i:540300;s:9:"昌都市";i:540302;s:9:"卡若区";i:540321;s:9:"江达县";i:540322;s:9:"贡觉县";i:540323;s:12:"类乌齐县";i:540324;s:9:"丁青县";i:540325;s:9:"察雅县";i:540326;s:9:"八宿县";i:540327;s:9:"左贡县";i:540328;s:9:"芒康县";i:540329;s:9:"洛隆县";i:540330;s:9:"边坝县";i:540400;s:9:"林芝市";i:540402;s:9:"巴宜区";i:540421;s:15:"工布江达县";i:540422;s:9:"米林县";i:540423;s:9:"墨脱县";i:540424;s:9:"波密县";i:540425;s:9:"察隅县";i:540426;s:6:"朗县";i:540500;s:9:"山南市";i:540502;s:9:"乃东区";i:540521;s:9:"扎囊县";i:540522;s:9:"贡嘎县";i:540523;s:9:"桑日县";i:540524;s:9:"琼结县";i:540525;s:9:"曲松县";i:540526;s:9:"措美县";i:540527;s:9:"洛扎县";i:540528;s:9:"加查县";i:540529;s:9:"隆子县";i:540530;s:9:"错那县";i:540531;s:12:"浪卡子县";i:540600;s:9:"那曲市";i:540602;s:9:"色尼区";i:540621;s:9:"嘉黎县";i:540622;s:9:"比如县";i:540623;s:9:"聂荣县";i:540624;s:9:"安多县";i:540625;s:9:"申扎县";i:540626;s:6:"索县";i:540627;s:9:"班戈县";i:540628;s:9:"巴青县";i:540629;s:9:"尼玛县";i:540630;s:9:"双湖县";i:542500;s:12:"阿里地区";i:542521;s:9:"普兰县";i:542522;s:9:"札达县";i:542523;s:9:"噶尔县";i:542524;s:9:"日土县";i:542525;s:9:"革吉县";i:542526;s:9:"改则县";i:542527;s:9:"措勤县";i:610000;s:9:"陕西省";i:610100;s:9:"西安市";i:610102;s:9:"新城区";i:610103;s:9:"碑林区";i:610104;s:9:"莲湖区";i:610111;s:9:"灞桥区";i:610112;s:9:"未央区";i:610113;s:9:"雁塔区";i:610114;s:9:"阎良区";i:610115;s:9:"临潼区";i:610116;s:9:"长安区";i:610117;s:9:"高陵区";i:610118;s:9:"鄠邑区";i:610122;s:9:"蓝田县";i:610124;s:9:"周至县";i:610200;s:9:"铜川市";i:610202;s:9:"王益区";i:610203;s:9:"印台区";i:610204;s:9:"耀州区";i:610222;s:9:"宜君县";i:610300;s:9:"宝鸡市";i:610302;s:9:"渭滨区";i:610303;s:9:"金台区";i:610304;s:9:"陈仓区";i:610322;s:9:"凤翔县";i:610323;s:9:"岐山县";i:610324;s:9:"扶风县";i:610326;s:6:"眉县";i:610327;s:6:"陇县";i:610328;s:9:"千阳县";i:610329;s:9:"麟游县";i:610330;s:6:"凤县";i:610331;s:9:"太白县";i:610400;s:9:"咸阳市";i:610402;s:9:"秦都区";i:610403;s:9:"杨陵区";i:610404;s:9:"渭城区";i:610422;s:9:"三原县";i:610423;s:9:"泾阳县";i:610424;s:6:"乾县";i:610425;s:9:"礼泉县";i:610426;s:9:"永寿县";i:610428;s:9:"长武县";i:610429;s:9:"旬邑县";i:610430;s:9:"淳化县";i:610431;s:9:"武功县";i:610481;s:9:"兴平市";i:610482;s:9:"彬州市";i:610500;s:9:"渭南市";i:610502;s:9:"临渭区";i:610503;s:9:"华州区";i:610522;s:9:"潼关县";i:610523;s:9:"大荔县";i:610524;s:9:"合阳县";i:610525;s:9:"澄城县";i:610526;s:9:"蒲城县";i:610527;s:9:"白水县";i:610528;s:9:"富平县";i:610581;s:9:"韩城市";i:610582;s:9:"华阴市";i:610600;s:9:"延安市";i:610602;s:9:"宝塔区";i:610603;s:9:"安塞区";i:610621;s:9:"延长县";i:610622;s:9:"延川县";i:610625;s:9:"志丹县";i:610626;s:9:"吴起县";i:610627;s:9:"甘泉县";i:610628;s:6:"富县";i:610629;s:9:"洛川县";i:610630;s:9:"宜川县";i:610631;s:9:"黄龙县";i:610632;s:9:"黄陵县";i:610681;s:9:"子长市";i:610700;s:9:"汉中市";i:610702;s:9:"汉台区";i:610703;s:9:"南郑区";i:610722;s:9:"城固县";i:610723;s:6:"洋县";i:610724;s:9:"西乡县";i:610725;s:6:"勉县";i:610726;s:9:"宁强县";i:610727;s:9:"略阳县";i:610728;s:9:"镇巴县";i:610729;s:9:"留坝县";i:610730;s:9:"佛坪县";i:610800;s:9:"榆林市";i:610802;s:9:"榆阳区";i:610803;s:9:"横山区";i:610822;s:9:"府谷县";i:610824;s:9:"靖边县";i:610825;s:9:"定边县";i:610826;s:9:"绥德县";i:610827;s:9:"米脂县";i:610828;s:6:"佳县";i:610829;s:9:"吴堡县";i:610830;s:9:"清涧县";i:610831;s:9:"子洲县";i:610881;s:9:"神木市";i:610900;s:9:"安康市";i:610902;s:9:"汉滨区";i:610921;s:9:"汉阴县";i:610922;s:9:"石泉县";i:610923;s:9:"宁陕县";i:610924;s:9:"紫阳县";i:610925;s:9:"岚皋县";i:610926;s:9:"平利县";i:610927;s:9:"镇坪县";i:610928;s:9:"旬阳县";i:610929;s:9:"白河县";i:611000;s:9:"商洛市";i:611002;s:9:"商州区";i:611021;s:9:"洛南县";i:611022;s:9:"丹凤县";i:611023;s:9:"商南县";i:611024;s:9:"山阳县";i:611025;s:9:"镇安县";i:611026;s:9:"柞水县";i:620000;s:9:"甘肃省";i:620100;s:9:"兰州市";i:620102;s:9:"城关区";i:620103;s:12:"七里河区";i:620104;s:9:"西固区";i:620105;s:9:"安宁区";i:620111;s:9:"红古区";i:620121;s:9:"永登县";i:620122;s:9:"皋兰县";i:620123;s:9:"榆中县";i:620200;s:12:"嘉峪关市";i:620300;s:9:"金昌市";i:620302;s:9:"金川区";i:620321;s:9:"永昌县";i:620400;s:9:"白银市";i:620402;s:9:"白银区";i:620403;s:9:"平川区";i:620421;s:9:"靖远县";i:620422;s:9:"会宁县";i:620423;s:9:"景泰县";i:620500;s:9:"天水市";i:620502;s:9:"秦州区";i:620503;s:9:"麦积区";i:620521;s:9:"清水县";i:620522;s:9:"秦安县";i:620523;s:9:"甘谷县";i:620524;s:9:"武山县";i:620525;s:24:"张家川回族自治县";i:620600;s:9:"武威市";i:620602;s:9:"凉州区";i:620621;s:9:"民勤县";i:620622;s:9:"古浪县";i:620623;s:21:"天祝藏族自治县";i:620700;s:9:"张掖市";i:620702;s:9:"甘州区";i:620721;s:24:"肃南裕固族自治县";i:620722;s:9:"民乐县";i:620723;s:9:"临泽县";i:620724;s:9:"高台县";i:620725;s:9:"山丹县";i:620800;s:9:"平凉市";i:620802;s:9:"崆峒区";i:620821;s:9:"泾川县";i:620822;s:9:"灵台县";i:620823;s:9:"崇信县";i:620825;s:9:"庄浪县";i:620826;s:9:"静宁县";i:620881;s:9:"华亭市";i:620900;s:9:"酒泉市";i:620902;s:9:"肃州区";i:620921;s:9:"金塔县";i:620922;s:9:"瓜州县";i:620923;s:24:"肃北蒙古族自治县";i:620924;s:30:"阿克塞哈萨克族自治县";i:620981;s:9:"玉门市";i:620982;s:9:"敦煌市";i:621000;s:9:"庆阳市";i:621002;s:9:"西峰区";i:621021;s:9:"庆城县";i:621022;s:6:"环县";i:621023;s:9:"华池县";i:621024;s:9:"合水县";i:621025;s:9:"正宁县";i:621026;s:6:"宁县";i:621027;s:9:"镇原县";i:621100;s:9:"定西市";i:621102;s:9:"安定区";i:621121;s:9:"通渭县";i:621122;s:9:"陇西县";i:621123;s:9:"渭源县";i:621124;s:9:"临洮县";i:621125;s:6:"漳县";i:621126;s:6:"岷县";i:621200;s:9:"陇南市";i:621202;s:9:"武都区";i:621221;s:6:"成县";i:621222;s:6:"文县";i:621223;s:9:"宕昌县";i:621224;s:6:"康县";i:621225;s:9:"西和县";i:621226;s:6:"礼县";i:621227;s:6:"徽县";i:621228;s:9:"两当县";i:622900;s:21:"临夏回族自治州";i:622901;s:9:"临夏市";i:622921;s:9:"临夏县";i:622922;s:9:"康乐县";i:622923;s:9:"永靖县";i:622924;s:9:"广河县";i:622925;s:9:"和政县";i:622926;s:18:"东乡族自治县";i:622927;s:45:"积石山保安族东乡族撒拉族自治县";i:623000;s:21:"甘南藏族自治州";i:623001;s:9:"合作市";i:623021;s:9:"临潭县";i:623022;s:9:"卓尼县";i:623023;s:9:"舟曲县";i:623024;s:9:"迭部县";i:623025;s:9:"玛曲县";i:623026;s:9:"碌曲县";i:623027;s:9:"夏河县";i:630000;s:9:"青海省";i:630100;s:9:"西宁市";i:630102;s:9:"城东区";i:630103;s:9:"城中区";i:630104;s:9:"城西区";i:630105;s:9:"城北区";i:630106;s:9:"湟中区";i:630121;s:27:"大通回族土族自治县";i:630123;s:9:"湟源县";i:630200;s:9:"海东市";i:630202;s:9:"乐都区";i:630203;s:9:"平安区";i:630222;s:27:"民和回族土族自治县";i:630223;s:21:"互助土族自治县";i:630224;s:21:"化隆回族自治县";i:630225;s:24:"循化撒拉族自治县";i:632200;s:21:"海北藏族自治州";i:632221;s:21:"门源回族自治县";i:632222;s:9:"祁连县";i:632223;s:9:"海晏县";i:632224;s:9:"刚察县";i:632300;s:21:"黄南藏族自治州";i:632301;s:9:"同仁市";i:632322;s:9:"尖扎县";i:632323;s:9:"泽库县";i:632324;s:24:"河南蒙古族自治县";i:632500;s:21:"海南藏族自治州";i:632521;s:9:"共和县";i:632522;s:9:"同德县";i:632523;s:9:"贵德县";i:632524;s:9:"兴海县";i:632525;s:9:"贵南县";i:632600;s:21:"果洛藏族自治州";i:632621;s:9:"玛沁县";i:632622;s:9:"班玛县";i:632623;s:9:"甘德县";i:632624;s:9:"达日县";i:632625;s:9:"久治县";i:632626;s:9:"玛多县";i:632700;s:21:"玉树藏族自治州";i:632701;s:9:"玉树市";i:632722;s:9:"杂多县";i:632723;s:9:"称多县";i:632724;s:9:"治多县";i:632725;s:9:"囊谦县";i:632726;s:12:"曲麻莱县";i:632800;s:30:"海西蒙古族藏族自治州";i:632801;s:12:"格尔木市";i:632802;s:12:"德令哈市";i:632803;s:9:"茫崖市";i:632821;s:9:"乌兰县";i:632822;s:9:"都兰县";i:632823;s:9:"天峻县";i:640000;s:21:"宁夏回族自治区";i:640100;s:9:"银川市";i:640104;s:9:"兴庆区";i:640105;s:9:"西夏区";i:640106;s:9:"金凤区";i:640121;s:9:"永宁县";i:640122;s:9:"贺兰县";i:640181;s:9:"灵武市";i:640200;s:12:"石嘴山市";i:640202;s:12:"大武口区";i:640205;s:9:"惠农区";i:640221;s:9:"平罗县";i:640300;s:9:"吴忠市";i:640302;s:9:"利通区";i:640303;s:12:"红寺堡区";i:640323;s:9:"盐池县";i:640324;s:9:"同心县";i:640381;s:12:"青铜峡市";i:640400;s:9:"固原市";i:640402;s:9:"原州区";i:640422;s:9:"西吉县";i:640423;s:9:"隆德县";i:640424;s:9:"泾源县";i:640425;s:9:"彭阳县";i:640500;s:9:"中卫市";i:640502;s:12:"沙坡头区";i:640521;s:9:"中宁县";i:640522;s:9:"海原县";i:650000;s:24:"新疆维吾尔自治区";i:650100;s:15:"乌鲁木齐市";i:650102;s:9:"天山区";i:650103;s:15:"沙依巴克区";i:650104;s:9:"新市区";i:650105;s:12:"水磨沟区";i:650106;s:12:"头屯河区";i:650107;s:12:"达坂城区";i:650109;s:9:"米东区";i:650121;s:15:"乌鲁木齐县";i:650200;s:15:"克拉玛依市";i:650202;s:12:"独山子区";i:650203;s:15:"克拉玛依区";i:650204;s:12:"白碱滩区";i:650205;s:12:"乌尔禾区";i:650400;s:12:"吐鲁番市";i:650402;s:9:"高昌区";i:650421;s:9:"鄯善县";i:650422;s:12:"托克逊县";i:650500;s:9:"哈密市";i:650502;s:9:"伊州区";i:650521;s:27:"巴里坤哈萨克自治县";i:650522;s:9:"伊吾县";i:652300;s:21:"昌吉回族自治州";i:652301;s:9:"昌吉市";i:652302;s:9:"阜康市";i:652323;s:12:"呼图壁县";i:652324;s:12:"玛纳斯县";i:652325;s:9:"奇台县";i:652327;s:15:"吉木萨尔县";i:652328;s:24:"木垒哈萨克自治县";i:652700;s:27:"博尔塔拉蒙古自治州";i:652701;s:9:"博乐市";i:652702;s:15:"阿拉山口市";i:652722;s:9:"精河县";i:652723;s:9:"温泉县";i:652800;s:27:"巴音郭楞蒙古自治州";i:652801;s:12:"库尔勒市";i:652822;s:9:"轮台县";i:652823;s:9:"尉犁县";i:652824;s:9:"若羌县";i:652825;s:9:"且末县";i:652826;s:21:"焉耆回族自治县";i:652827;s:9:"和静县";i:652828;s:9:"和硕县";i:652829;s:9:"博湖县";i:652900;s:15:"阿克苏地区";i:652901;s:12:"阿克苏市";i:652902;s:9:"库车市";i:652922;s:9:"温宿县";i:652924;s:9:"沙雅县";i:652925;s:9:"新和县";i:652926;s:9:"拜城县";i:652927;s:9:"乌什县";i:652928;s:12:"阿瓦提县";i:652929;s:9:"柯坪县";i:653000;s:33:"克孜勒苏柯尔克孜自治州";i:653001;s:12:"阿图什市";i:653022;s:12:"阿克陶县";i:653023;s:12:"阿合奇县";i:653024;s:9:"乌恰县";i:653100;s:12:"喀什地区";i:653101;s:9:"喀什市";i:653121;s:9:"疏附县";i:653122;s:9:"疏勒县";i:653123;s:12:"英吉沙县";i:653124;s:9:"泽普县";i:653125;s:9:"莎车县";i:653126;s:9:"叶城县";i:653127;s:12:"麦盖提县";i:653128;s:12:"岳普湖县";i:653129;s:9:"伽师县";i:653130;s:9:"巴楚县";i:653131;s:33:"塔什库尔干塔吉克自治县";i:653200;s:12:"和田地区";i:653201;s:9:"和田市";i:653221;s:9:"和田县";i:653222;s:9:"墨玉县";i:653223;s:9:"皮山县";i:653224;s:9:"洛浦县";i:653225;s:9:"策勒县";i:653226;s:9:"于田县";i:653227;s:9:"民丰县";i:654000;s:24:"伊犁哈萨克自治州";i:654002;s:9:"伊宁市";i:654003;s:9:"奎屯市";i:654004;s:15:"霍尔果斯市";i:654021;s:9:"伊宁县";i:654022;s:27:"察布查尔锡伯自治县";i:654023;s:9:"霍城县";i:654024;s:9:"巩留县";i:654025;s:9:"新源县";i:654026;s:9:"昭苏县";i:654027;s:12:"特克斯县";i:654028;s:12:"尼勒克县";i:654200;s:12:"塔城地区";i:654201;s:9:"塔城市";i:654202;s:9:"乌苏市";i:654221;s:9:"额敏县";i:654223;s:9:"沙湾县";i:654224;s:9:"托里县";i:654225;s:9:"裕民县";i:654226;s:30:"和布克赛尔蒙古自治县";i:654300;s:15:"阿勒泰地区";i:654301;s:12:"阿勒泰市";i:654321;s:12:"布尔津县";i:654322;s:9:"富蕴县";i:654323;s:9:"福海县";i:654324;s:12:"哈巴河县";i:654325;s:9:"青河县";i:654326;s:12:"吉木乃县";i:659001;s:12:"石河子市";i:659002;s:12:"阿拉尔市";i:659003;s:15:"图木舒克市";i:659004;s:12:"五家渠市";i:659005;s:9:"北屯市";i:659006;s:12:"铁门关市";i:659007;s:9:"双河市";i:659008;s:15:"可克达拉市";i:659009;s:9:"昆玉市";i:659010;s:12:"胡杨河市";i:710000;s:9:"台湾省";i:810000;s:21:"香港特别行政区";i:820000;s:21:"澳门特别行政区";}';
		$Code = array();
		$Code = unserialize($Data);
		$returnValue = null;
		foreach ($Code as $key => $value) {
			if ($in == $key) {
				$returnValue = $value;
			}
		}
		return $returnValue;
	}
}

if ($argv[1] != 'id') {
	exit('系统检测到违规操作！' . "\n");
}

//获取网易云评论------------------------------------------------
$id = $argv[2];

//防止用户重复提交任务
$weiyixingFile = fopen('weiyixing-' . $id . '.txt', 'x');
fwrite($weiyixingFile, '50'); //写入进度
fclose($weiyixingFile);

$yuandata = array();
$count1 = 0;
//边界，用于跳出循环
$bianjie = '';
$networkError = 0; //处理网络错误导致post失败，返回null
$count5 = 0;
$RePingData = array(); //保存用户信息及评论
for ($i = 0; $i <= 999999999; $i = $i + 20) {
	$limitoffset = array('limit' => '20', 'offset' => $i);
	$value = send_post('https://music.163.com/api/v1/resource/comments/R_SO_4_' . $id, $limitoffset, $id);
	$decodeValue = json_decode($value);
	$commentsValue = 'comments';
	$accidentError = false;
	if ($decodeValue->$commentsValue == null) {
		$accidentError = true;
	}
	if ($accidentError == true) {
		$networkError++;
		if ($networkError > 4) {
			break;
		}
		continue;
	}
	//判断当前页最后一个评论与下一页最后一个评论相同时(没有内容了)，跳出循环。
	$commentsValueEnd = array_key_last($decodeValue->$commentsValue);
	if ($bianjie == $decodeValue->$commentsValue[$commentsValueEnd]) {
		break;
	} else {
		$bianjie = $decodeValue->$commentsValue[$commentsValueEnd];
	}
	foreach ($decodeValue->$commentsValue as $key => $value) {
		$yuandata[$count1] = $value->content;
		$count1++;
	}
	foreach ($decodeValue->$commentsValue as $key => $value) {
		$userId = $value->user->userId; //用户id
		$nullPost_data = array();
		$userData = send_post3('https://music.163.com/api/v1/user/detail/' . $userId, $nullPost_data, $id);
		$decodeUserData = json_decode($userData);
		if ($decodeUserData->profile->gender == 0) {
			$UserGender = null;
		} else if ($decodeUserData->profile->gender == 1) {
			$UserGender = '男';
		} else if ($decodeUserData->profile->gender == 2) {
			$UserGender = '女';
		}
		if ($decodeUserData->profile->birthday == -2209017600000) {
			$UserAge = null;
		} else {
			$time = new Time(); //新建对象；
			$UserAge = $time->getMsecTime() - $decodeUserData->profile->birthday;
			$UserAge = $time->Millisecond_timestamp_to_Age($UserAge);
		}
		if ($decodeUserData->profile->birthday == -2209017600000) {
			$UserBirthday = null;
		} else {
			$time = new Time(); //新建对象；
			$UserBirthday = $time->getMsecToMescdate($decodeUserData->profile->birthday, 'UserBirthday');
		}
		if ($decodeUserData->profile->city != null) {
			$xingzhengcode = new XingZhengCode();
			$UserCity = $xingzhengcode->xingzhengcode($decodeUserData->profile->city);
		}
		$time2 = new Time();
		$UserContentTime = $time2->getMsecToMescdate($value->time, 'UserContentTime');
		if ($value->beReplied != null && $value->beReplied[0]->content != null) {
			$UserContent = ['beReplied' => ['UserName' => $value->beReplied[0]->user->nickname, 'UserAvatar' => $value->beReplied[0]->user->avatarUrl, 'UserContent' => $value->beReplied[0]->content], 'UserContent' => $value->content];
		} else {
			$UserContent = ['UserContent' => $value->content];
		}
		$RePingData[$count5] = ['UserId' => $userId, 'UserAvatar' => $decodeUserData->profile->avatarUrl, 'UserName' => $decodeUserData->profile->nickname, 'UserGender' => $UserGender, 'UserAge' => $UserAge, 'UserBirthday' => $UserBirthday, 'UserCity' => $UserCity, 'UserContent' => $UserContent, 'UserContentTime' => $UserContentTime, 'UserLikedCount' => $value->likedCount];
		$count5++;
	}
}

//防止用户重复提交任务
$weiyixingFile = fopen('weiyixing-' . $id . '.txt', 'w');
fwrite($weiyixingFile, '75'); //写入进度
fclose($weiyixingFile);

//中文分词
$yuandata2 = array();
$count2 = 0;
foreach ($yuandata as $value4) {
	$typemsg = array('text' => $value4);
	$typemsg = json_encode($typemsg); //把数组转换为json
	$value2 = send_post2('http://39.96.43.154:8080/api', $typemsg);
	$value2 = json_decode($value2); //把json转换为对象
	foreach ($value2->words as $value3) { //遍历获得所有分词
		if ($value3->pos != 'u' && $value3->pos != 'c' && $value3->pos != 'p' && $value3->text != '[' && $value3->text != ']' && $value3->text != '\\' && $value3->text != '\\\\' && $value3->text != '\\n' && $value3->text != '\\\\n' && $value3->text != 'n' && $value3->text != '[]') { //排除：助词，例如“的, 地”、连词，例如“和, 虽然”、介词，例如“在, 把”、和"[]"，"\", "\\", "\n", "\\n", "n", "[", "]"符
			$yuandata2[$count2] = $value3->text;
			$count2++;
		}
	}
}

//防止用户重复提交任务
$weiyixingFile = fopen('weiyixing-' . $id . '.txt', 'w');
fwrite($weiyixingFile, '100'); //写入进度
fclose($weiyixingFile);

//统计词频
$yuandata3 = array();
foreach ($yuandata2 as $value5) {
	//防止yuandata3重复
	$count4 = 0;
	foreach ($yuandata3 as $key => $value7) {
		if ($value5 == $key) {
			$count4++;
		}
	}
	if ($count4 == 0) {
		//统计次数
		$count3 = 0;
		foreach ($yuandata2 as $value6) {
			if ($value5 == $value6) {
				$count3++;
			}
		}
		$yuandata3[$value5] = $count3; //最后得出的数据，1是一次，2是二次；以此类推
	}
}

//写入词频信息
$yuandata1 = fopen($id . '-yuandata.txt', 'x');
$yuandata3 = serialize($yuandata3);
fwrite($yuandata1, $yuandata3);
fclose($yuandata1);

//写入单曲热评库
$RePingData1 = fopen($id . '-RePingData.txt', 'x');
$RePingData2 = serialize($RePingData);
fwrite($RePingData1, $RePingData2);
fclose($RePingData1);

//防止用户重复提交任务——删除weiyixing-id.txt
unlink('weiyixing-' . $id . '.txt');

/*目前待处理：
解决词云在评论数量为40条时词云太小
点击饼状图弹出多个网易云搜索页面
完成热评功能
简化收发post请求的函数
*/